# Adoption extraction tables

## Contents
#### Setup
1. [Import packages and options](#import_packages)
2. [Define key variables](#define_key_variables)

#### Familyman data extractions
3. [Adoption_parties](#adoption_parties) - Creates a table with applicants and respondents
4. [Adoptions_applications](#adoptions_applications) - Creates a table with adoption applications, linking the events and the events fields table where the field model codes are for adoptions
5. [Adoptions_cases](#adoptions_cases) - Creates a table which extracts all adoption cases from the case_fields table
6. [Adoptions_disposals](#adoptions_disposals) - Creates a table with all the adoption disposal events from the events table
7. [Adoptions_disposal_fields](#adoptions_disposal_fields) - Extracts adoption information from the fields table

#### Stage 1 - [Creating the main adoption parties data](#Stage_1)

8. [adopt_app_count](#adopt_app_count) - Counts the number of applicants per case
9. [adopt_appl_sex](#adopt_appl_sex) - Creates a table showing the sex of the applicants
10. [adopt_appl_rtc](#adopt_appl_rtc) - Creates a table showing the relationships to the child and the sex of the applicants
11. [adopt_applicant_type](#adopt_applicant_type) - Creates a table showing the type of applicant
12. [adopt_child_parties](#adopt_child_parties) - Creates a table with the party information from child applicants

#### Stage 2 - [Applications](#applications)

13. [adopt_application_4](#adopt_application_4) - Stage 1 of joining the applications table with information from the applicant type and cases table
14. [adopt_application_5](#adopt_application_5) - Final formatting of adopt_application_4 table
15. [adopt_apps_6_adoptions_only](#adopt_apps_6_adoptions_only)  - Splits the adopt_application_5 table and extracts only the adoption application type cases
16. [adopt_apps_6_non_adoptions](#adopt_apps_6_non_adoptions) - Splits the adopt_application_5 table and extracts only the non-adoption application type cases 
17. [summaries](#summaries) - provides some useful summaries not currently used in fcsq
18. [adopt_adopt_only_case_count](#adopt_adopt_only_case_count) - Creates a table with the total case counts for adoption case types by quarter

#### Stage 3 - [Disposals](#disposals)
19. [adopt_order_type](#adopt_order_type) - Creates a table which extracts the type of order from the adopt_disposals_fields table where the field_model shows type of order
20. [adopt_disposals_type](#adopt_disposals_type) - Creates a table which extracts the type of disposal by matching the adopt_disposals table to the adopt_disposals_fields table where the field_model shows type of disposal
21. [adopt_country_of_birth](#adopt_country_of_birth) - Extracts the child's country of birth from the disposal_fields table
22. [adopt_disposals_with_child](#adopt_disposals_with_child) - Creates a table which matches the disposals data with the child information
23. [adopt_disposals5](#adopt_disposals5) - Formats the adopt_disposals_with_child table
24. [adopt_disposals5_adoption](#adopt_disposals5_adoption) - Splits the adopt_disposals5 table extracting just adoption type cases
25. [adopt_disposals5_non_adoption](#adopt_disposals5_non_adoption) - Splits the adopt_disposals5 table extracting just non-adoption type cases
26. [adopt_disposals5_non_orders](#adopt_disposals5_non_orders) - Splits the adopt_disposals5 table extracting just cases where no order was made
27. [adopt_disposals5_2011](#adopt_disposals5_2011) - Splits the adopt_disposals5 table extracting just cases from 2011 onwards

#### Stage 4 - [Update the country of birth lookup](#Country_of_birth_lookup_update)
28. [adopt_birth_country_unknown](#adopt_birth_country_unknown) - Creates a table containing the nationalities we do not currently have registered
29. [adopt_birth_country_added](#adopt_birth_country_added)- This is where we have to manually add the unknown nationalities and flag as either foreign or in the UK
30. [adopt_country_lookup_update](#adopt_country_lookup_update)- Joins the existing lookup table with the new added data
31. [adopt_birth_country_lookup](#adopt_birth_country_lookup)- updates the lookup table using the newly updated temporary table

#### Stage 5 - [Preparing the final output](#Stage_5_-_Preparing_the_final_output)

32. [adopt_adoptions_only_standard](#adopt_adoptions_only_standard)- Creates a table with Adoption cases with a standard order type
33. [adopt_adoption_only_convention](#adopt_adoption_only_convention)- Creates a table with Adoption cases with a convention order type
34. [adopt_adoption_only_foreign](#adopt_adoption_only_foreign)- Creates a table with Adoption cases with a foreign order type
35. [adopt_adoptions_other_only](#adopt_adoptions_other_only)- Creates a table with Adoption cases with an other order type
36. [adopt_adoption_only](#adopt_adoption_only) - Joins the standard, convention, foreign and other tables
37. [adopt_adoption_placement](#adopt_adoption_placement) - Creates a table containing data on placement orders
38. [adopt_placement_revoke_or_vary](#adopt_placement_revoke_or_vary)- Creates a table containing data for a revoke and vary placement order
39. [adopt_adoption_contact_s26](#adopt_adoption_contact_s26)- Creates a table containing data where the order type is a contact order under the section 26 adoption and children act
40. [adopt_contact_s26_revoke_vary](#adopt_contact_s26_revoke_vary) - Creates a table containing data where the order type is a revoke or vary contact order under the section 26 adoption and children act
41. [adopt_change_surname](#adopt_change_surname) - Creates a table of cases where the order type is changing surnames
42. [adopt_remove_child_from_uk](#adopt_remove_child_from_uk) - Creates a table of cases where the order type is removing a child from the UK
43. [adopt_other_order_type](#adopt_other_order_type) - Creates a table of cases where the order type is other
44. [adopt_non_adopt_types](#adopt_non_adopt_types) - Joins all the non-adoption type tables together
45. [adopt_non_adoptions](#adopt_non_adoptions) - Group the non-adoption cases together and produces a count for each type and quarter
46. [adopt_applications](#adopt_applications) - Joins the adoption_only table with the non_adoptions table
47. [adopt_disp_details](#adopt_disp_details) - Joins the adopt_disposals5_2011 table with foreign flag from adopt_birth_country_lookup and the event model description from the adoption_event_model_desc table
48. [adopt_disp_csv_data](#adopt_disp_csv_data) - Formats raw adopt_disp_details table data ready for CSV output
49. [adopt_disp_order_type](#adopt_disp_order_type)- adds order type to the adopt_disp_csv_data table
50. [adopt_disposals](#adopt_disposals) - groups all variables in adopt_disp_order_type table and produces a total count for each distinct row
51. [adopt_application_case_count](#adopt_application_case_count) - Creates a table which produces totals for cases started per quarter from the adopt_application_4 table
52. [adopt_disposal_case_count](#adopt_disposal_case_count) - Creates a table which produces totals for cases closed per quarter from the adopt_disposal_cases table
53. [adopt_csv](#adopt_csv) - Creates the initial version of the final CSV output, adding together the adopt_applications, adopt_disposals, adopt_application_case_count and adopt_disposal_case_count tables
54. [adopt_csv2](#adopt_csv2) - Filters the adopt_csv2 table by later than 2010, not equal to the current quarter (update each quarter), and then orders the table. This is then converted and output to a CSV file

## 1. Import packages and set options 
<a name=import_packages></a>

In [2]:
import pandas as pd  # a module which provides the data structures and functions to store and manipulate tables in dataframes
import pydbtools as pydb  # A module which allows SQL queries to be run on the Analytical Platform from Python, see https://github.com/moj-analytical-services/pydbtools
import boto3  # allows you to directly create, update, and delete AWS resources from Python scripts

# sets parameters to view dataframes for tables easier
pd.set_option("display.max_columns", 100)
pd.set_option("display.width", 900)
pd.set_option("display.max_colwidth", 200)

## 2. Define key variables to be used throughout the notebook 
<a name="define_key_variables"></a>

In [3]:
#this is the database we will be extracting from
database = "familyman_dev_v3" 

#this extracts the latest snapshot from athena
get_snapshot_date = f"SELECT mojap_snapshot_date from {database}.events order by mojap_snapshot_date desc limit 1"
snapshot_date = str(pydb.read_sql_query(get_snapshot_date)['mojap_snapshot_date'].values[0])

#this is the athena database we will be storing our tables in
fcsq_database = "fcsq"

#this is the s3 bucket we will be saving data to
s3 = boto3.resource("s3")
bucket = s3.Bucket("alpha-family-data")

#change these to the current quarter not the quarter being published
latest_quarter = 3
latest_year = 2022

## Familyman data extractions
<a name="familyman_extracts"></a>

## 3. Adoption_parties table - Creates a table with applicants and respondents
<a name="adoption_parties"></a>

### Drop the adoptions_parties table if it already exists and remove its data from the S3 bucket

In [1]:
drop_adoptions_parties = f"""
DROP TABLE IF EXISTS fcsq.ADOPTIONS_PARTIES;
"""
pydb.start_query_execution_and_wait(drop_adoptions_parties)

# clean up previous adoptions_parties files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/Adoptions_Parties/").delete();

NameError: name 'pydb' is not defined

### Create the adoptions_parties table in Athena

In [5]:
create_adoptions_parties = f"""
CREATE TABLE IF NOT EXISTS fcsq.ADOPTIONS_PARTIES
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/Adoptions_Parties') AS
SELECT R.CASE_NUMBER,
  R.ROLE,
  R.ROLE_MODEL,
  R.REPRESENTATIVE_ROLE AS Representative,
  F.FIELD_MODEL,
  F.VALUE AS Rel_to_child,
  R.PARTY,
  P.DOB,
  P.GENDER,
  P.MOJAP_SNAPSHOT_DATE
FROM {database}.parties P
INNER JOIN {database}.roles R
ON P.PARTY = R.PARTY
INNER JOIN {database}.role_fields F
ON R.ROLE               = F.ROLE
WHERE ((R.ROLE_MODEL     = 'APLZ' --Applicant role model code
AND F.FIELD_MODEL = 'APLZ_RTC') -- Applicant relationship to child field model
OR (R.ROLE_MODEL        = 'CHLDZ'
AND F.FIELD_MODEL = 'CHLDZ_CP')) -- CHLDZ is child role model, CHLDZ_CP is whether applicant is a child
AND R.mojap_snapshot_date = date '{snapshot_date}'
AND F.mojap_snapshot_date = date '{snapshot_date}'
AND P.mojap_snapshot_date = date '{snapshot_date}'
"""

pydb.start_query_execution_and_wait(create_adoptions_parties);

#### Adoption_parties validation

In [6]:
# Query the table just created. The database to query is called __temp__, this is
# an alias for a sandbox database that is created for each user. For more details, see
# the pydbtools docs

parties_count = pydb.read_sql_query("select count(*) as count from fcsq.adoptions_parties")

parties_count

    count
0  328361

## 4. Adoptions_applications table - Creates a table with adoption applications, linking the events and the events fields table where the field model codes are for adoptions
<a name="adoptions_applications"></a>

### Drop the adoptions_applications table if it already exists and remove its data from the S3 bucket

In [7]:
drop_adoptions_applications = "DROP TABLE IF EXISTS fcsq.ADOPTIONS_APPLICATIONS;"
pydb.start_query_execution_and_wait(drop_adoptions_applications)

bucket.objects.filter(
    Prefix="fcsq_processing/Adoption/Adoptions_applications/"
).delete();

### Create the adoptions_applications table in Athena

In [8]:
create_adoptions_applications_u21 = f"""
SELECT E.CASE_NUMBER,
  E.EVENT,
  E.RECEIPT_DATE,
  E.ENTRY_DATE,
  CASE E.RECEIPT_DATE
      WHEN NULL THEN E.ENTRY_DATE
      ELSE E.RECEIPT_DATE
  END AS Receipt_date2,
  E.EVENT_MODEL,
  F.VALUE  AS App_Type,
  date_parse(F1.VALUE, '%Y-%m-%d') AS Date_of_issue,
  F2.VALUE AS High_court
FROM {database}.events E
INNER JOIN {database}.event_fields F2
ON E.EVENT = F2.EVENT
INNER JOIN {database}.event_fields F1
ON E.EVENT = F1.EVENT
INNER JOIN {database}.event_fields F
ON E.EVENT               = F.EVENT
WHERE (E.EVENT_MODEL      = 'U21' --adoption proceedings issued
AND F.FIELD_MODEL  = 'U21_1' -- application type
AND F1.FIELD_MODEL = 'U21_2' -- date of issue
AND F2.FIELD_MODEL = 'U21_HC') -- high court
AND E.mojap_snapshot_date = date '{snapshot_date}'
AND F.mojap_snapshot_date = date '{snapshot_date}'
AND F1.mojap_snapshot_date = date '{snapshot_date}'
AND F2.mojap_snapshot_date = date '{snapshot_date}';
"""


pydb.create_temp_table(create_adoptions_applications_u21, "adoptions_applications_u21")
print("u21 applications done")

create_adoptions_applications_G50 = f"""
SELECT
  E.CASE_NUMBER,
  E.EVENT,
  E.RECEIPT_DATE,
  E.ENTRY_DATE,
  CASE E.RECEIPT_DATE
      WHEN NULL THEN E.ENTRY_DATE
      ELSE E.RECEIPT_DATE
  END AS Receipt_date2,
  E.EVENT_MODEL,
  CASE WHEN F.VALUE like '%RUK%' and F.VALUE like '%CCS%' THEN 'RUK,CCS' --RUK: remove child from UK, CCS: Change child surname
       WHEN F.VALUE like '%RUK%' THEN 'RUK' 
       WHEN F.VALUE like '%CCS%' THEN 'CCS'
        END AS App_Type, /*Have done it like this so that we do not include non adoption app types*/
  CASE E.RECEIPT_DATE
      WHEN NULL THEN E.ENTRY_DATE
      ELSE E.RECEIPT_DATE
  END AS Date_of_issue,
  'N' AS High_court
FROM
  {database}.events E
  INNER JOIN {database}.event_fields F
    ON E.EVENT = F.EVENT
WHERE
  F.FIELD_MODEL = 'G50_AT' -- type of application
  AND (F.VALUE like '%RUK%'
   OR F.VALUE like '%CCS%')
   AND E.mojap_snapshot_date = date '{snapshot_date}'
   AND F.mojap_snapshot_date = date '{snapshot_date}';
"""

pydb.create_temp_table(create_adoptions_applications_G50, "adoptions_applications_G50")


print("G50 cases done")

create_adoptions_applications = f"""
CREATE TABLE IF NOT EXISTS fcsq.ADOPTIONS_APPLICATIONS
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/Adoptions_applications') AS
SELECT
  *
FROM
  __temp__.ADOPTIONS_APPLICATIONS_U21
WHERE case_number <> 'CV11Z00105'
UNION ALL
SELECT
  *
FROM
  __temp__.ADOPTIONS_APPLICATIONS_G50
WHERE case_number <> 'CV11Z00105';
"""

pydb.start_query_execution_and_wait(create_adoptions_applications);

print("adoptions_applications table created")

u21 applications done
G50 cases done
adoptions_applications table created

#### Adoptions_applications validation

In [9]:
applications_count = pydb.read_sql_query("select count(*) as count from fcsq.adoptions_applications")
applications_count

    count
0  182095

## 5. Adoptions_cases table - Creates a table which extracts all adoption cases from the case_fields table
<a name="adoptions_cases"></a>

### Drop the adoptions_cases table if it already exists and remove its data from the S3 bucket

In [11]:
drop_adoptions_cases = "DROP TABLE IF EXISTS fcsq.ADOPTIONS_CASES;"
pydb.start_query_execution_and_wait(drop_adoptions_cases)

bucket.objects.filter(Prefix="fcsq_processing/Adoption/Adoptions_cases/").delete();

### Create the adoptions_cases table in Athena

In [12]:
create_adoptions_cases = f"""
CREATE TABLE IF NOT EXISTS fcsq.ADOPTIONS_CASES
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/Adoptions_cases') AS
SELECT F.CASE_NUMBER,
  F.VALUE AS Contested,
  F1.VALUE AS Case_issue_date,
  F2.VALUE AS Case_app_type,
  CASE F.CASE_NUMBER
      WHEN 'BM08Z09028' THEN '2008-09-19'
      ELSE F1.VALUE
  END AS Case_issue_date2
FROM {database}.case_fields F
INNER JOIN {database}.case_fields F2
ON F.CASE_NUMBER = F2.CASE_NUMBER
INNER JOIN {database}.case_fields F1
ON F.CASE_NUMBER    = F1.CASE_NUMBER
WHERE F.FIELD_MODEL = 'FM3A_AC' -- adoption contested
AND F1.FIELD_MODEL  = 'FM3A_DOI' -- date of issue
AND F2.FIELD_MODEL  = 'FM3A_AT' -- application type
AND F.case_number <> 'CV11Z00105' -- broken case number
AND F.mojap_snapshot_date = date '{snapshot_date}'
AND F1.mojap_snapshot_date = date '{snapshot_date}'
AND F2.mojap_snapshot_date = date '{snapshot_date}';

"""
pydb.start_query_execution_and_wait(create_adoptions_cases);

#### Adoptions_cases validation

In [13]:
cases_count = pydb.read_sql_query("select count(*) as count from fcsq.adoptions_cases")
cases_count

    count
0  140239

## 6. Adoptions_disposals table - Creates a table with all the adoption disposal events from the events table 
<a name="adoptions_disposals"></a>

### Drop the adoptions_disposals table if it already exists and remove its data from the S3 bucket

In [14]:
drop_adoptions_disposals = "DROP TABLE IF EXISTS fcsq.ADOPTIONS_DISPOSALS;"
pydb.start_query_execution_and_wait(drop_adoptions_disposals)

bucket.objects.filter(Prefix="fcsq_processing/Adoption/Adoptions_disposals/").delete();

### Create the adoptions_disposals table in Athena

In [15]:
create_adoptions_disposals = f"""
CREATE TABLE IF NOT EXISTS fcsq.ADOPTIONS_DISPOSALS
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/Adoptions_disposals') AS
SELECT E.CASE_NUMBER,
  E.EVENT,
  E.RECEIPT_DATE,
  E.ENTRY_DATE,
  CASE E.RECEIPT_DATE
      WHEN NULL THEN E.ENTRY_DATE
      ELSE E.RECEIPT_DATE  
  END AS Receipt_date2,
  E.EVENT_MODEL
FROM {database}.events E
WHERE ((E.EVENT_MODEL IN ('A70', 'A71', 'A72', 'A73', 'A74', 'A75', 'A76', 'A77', 'A78', 'A79', 'A80', 'A81', 'A12', 'A13', 'A15') -- all adoption event model codes
AND E.ERROR          = 'N')
OR (E.EVENT_MODEL    IN ('G63', 'ORDREF', 'ORDNOM') -- application withdrawn, order refused, no order made
AND E.ERROR          = 'N')
OR (E.EVENT_MODEL    IN ('A12', 'A13', 'A15') -- freeing order, revoking freeing order, adoption order
AND E.ERROR          = 'N'))
AND E.case_number <> 'CV11Z00105'
AND E.mojap_snapshot_date = date '{snapshot_date}'; 
"""
pydb.start_query_execution_and_wait(create_adoptions_disposals);

#### Adoptions_disposals validation

In [16]:
disposals_count = pydb.read_sql_query("select count(*) as count from fcsq.adoptions_disposals")
disposals_count

    count
0  505155

## 7. Adoptions_disposal_fields table - Extracts adoption information from the fields table
<a name="adoptions_disposal_fields"></a>

### Drop the adoptions_disposal_fields table if it already exists and remove its data from the S3 bucket

In [17]:
drop_adoptions_disposal_fields = "DROP TABLE IF EXISTS fcsq.ADOPTIONS_DISPOSAL_FIELDS;"
pydb.start_query_execution_and_wait(drop_adoptions_disposal_fields)

bucket.objects.filter(
    Prefix="fcsq_processing/Adoption/Adoptions_disposal_fields/"
).delete();

### Create the adoptions_disposal_fields table in Athena

In [18]:
create_adoptions_disposal_fields = f"""
CREATE TABLE IF NOT EXISTS fcsq.ADOPTIONS_DISPOSAL_FIELDS
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/Adoptions_disposal_fields') AS
SELECT EVENT,
FIELD_MODEL,
VALUE
FROM {database}.event_fields E
WHERE (FIELD_MODEL LIKE 'A1%'
  OR FIELD_MODEL LIKE 'A7%'
  OR FIELD_MODEL IN ('G63_1', 'ORDNOM_5', 'ORDREF_5', 'A80_4', 'A81_5')) -- extracts all adoption related fields from the event_fields table
  AND E.mojap_snapshot_date = date '{snapshot_date}';
"""
pydb.start_query_execution_and_wait(create_adoptions_disposal_fields);

#### Adoptions_disposal_fields validation

In [19]:
disposal_fields_count = pydb.read_sql_query("select count(*) as count from fcsq.adoptions_disposal_fields")
disposal_fields_count

     count
0  2521299

# Stage 1 - Create The Main Parties Data
<a name="Stage_1"></a>

## 8. Adopt_app_count table - Counts the number of applicants per case
<a name="adopt_app_count"></a>

### Drop the adopt_app_count table if it already exists and remove its data from the S3 bucket

In [20]:
drop_adopt_app_count = f"""
DROP TABLE IF EXISTS fcsq.ADOPT_APP_COUNT;
"""
pydb.start_query_execution_and_wait(drop_adopt_app_count)

# clean up previous adopt_app_count files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_app_count/").delete();

### Create the adopt_app_count table in Athena

In [21]:
create_adopt_app_count = f"""
CREATE TABLE IF NOT EXISTS fcsq.ADOPT_APP_COUNT
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_app_count') AS
SELECT case_number, role_model, COUNT(role) AS countofrole
FROM fcsq.adoptions_parties
GROUP BY case_number, role_model
HAVING role_model = 'APLZ' -- applicant role model code; 
"""

pydb.start_query_execution_and_wait(create_adopt_app_count);

#### adopt_app_count validation

In [22]:
create_adopt_app_count_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_app_count")
create_adopt_app_count_count

    count
0  140260

## 9. Adopt_appl_sex table - Creates a table showing the sex of the applicants
<a name="adopt_appl_sex"></a>

### Drop the adopt_appl_sex table if it already exists and remove its data from the S3 bucket

In [23]:
drop_adopt_appl_sex = f"""
DROP TABLE IF EXISTS fcsq.ADOPT_APPL_SEX;
"""
pydb.start_query_execution_and_wait(drop_adopt_appl_sex)

# clean up previous adopt_appl_sex files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_appl_sex/").delete();

### Create the adopt_appl_sex table in Athena

In [24]:
create_adopt_appl_sex = f"""
CREATE TABLE IF NOT EXISTS fcsq.ADOPT_APPL_SEX
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_appl_sex') AS
SELECT app_count.case_number, app_count.role_model, 
app_count.countofrole, 
MIN(parties.gender) min_sex,
MAX(parties_1.gender) max_sex
FROM fcsq.adopt_app_count app_count INNER JOIN fcsq.adoptions_parties parties ON app_count.case_number = parties.case_number
INNER JOIN fcsq.adoptions_parties parties_1 ON app_count.case_number = parties_1.case_number
GROUP BY app_count.case_number, app_count.role_model, app_count.countofrole, parties.role_model, parties_1.role_model
HAVING parties.role_model='APLZ' AND parties_1.role_model='APLZ' --applicant role model code; 
"""

pydb.start_query_execution_and_wait(create_adopt_appl_sex);

#### adopt_appl_sex validation

In [25]:
adopt_appl_sex_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_appl_sex")
adopt_appl_sex_count

    count
0  140260

## 10. adopt_appl_rtc table - Creates a table showing the relationships to the child and the sex of the applicants
<a name="adopt_appl_rtc"></a>

### Drop the adopt_appl_rtc table if it already exists and remove its data from the S3 bucket

In [26]:
drop_adopt_appl_rtc = f"""
DROP TABLE IF EXISTS fcsq.adopt_appl_rtc;
"""
pydb.start_query_execution_and_wait(drop_adopt_appl_rtc)

# clean up previous adopt_appl_rtc files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_appl_rtc/").delete();

### Create the adopt_appl_rtc table in Athena

In [27]:
create_adopt_appl_rtc = f"""
CREATE TABLE IF NOT EXISTS fcsq.ADOPT_APPL_RTC
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_appl_rtc') AS
SELECT appl_sex.case_number, 
        appl_sex.role_model, 
        appl_sex.countofrole, 
        appl_sex.min_sex, 
        appl_sex.max_sex, 
        MIN(parties.rel_to_child) min_rtc, 
        MAX(parties_1.rel_to_child) max_rtc
FROM fcsq.adopt_appl_sex appl_sex
INNER JOIN fcsq.adoptions_parties parties 
        ON appl_sex.case_number = parties.case_number 
INNER JOIN fcsq.adoptions_parties parties_1 
        ON appl_sex.case_number = parties_1.case_number
GROUP BY appl_sex.case_number, 
          appl_sex.role_model, 
          appl_sex.countofrole, 
          appl_sex.min_sex, 
          appl_sex.max_sex, 
          parties.role_model, 
          parties_1.role_model
HAVING parties.role_model='APLZ' AND parties_1.role_model='APLZ' -- applicant role model code; 
"""

pydb.start_query_execution_and_wait(create_adopt_appl_rtc);

#### adopt_appl_rtc validation

In [28]:
adopt_appl_rtc_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_appl_rtc")
adopt_appl_rtc_count

    count
0  140260

## 11. adopt_applicant_type table - Creates a table showing the type of applicant
<a name="adopt_applicant_type"></a>

### Drop the adopt_applicant_type table if it already exists and remove its data from the S3 bucket

In [29]:
drop_adopt_applicant_type = f"""
DROP TABLE IF EXISTS fcsq.adopt_applicant_type;
"""
pydb.start_query_execution_and_wait(drop_adopt_applicant_type)

# clean up previous adopt_applicant_type files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_applicant_type/").delete();

### Create the adopt_applicant_type table in Athena

In [30]:
create_adopt_applicant_type_a = f"""
SELECT case_number, 
        role_model, 
        countofrole number_applicants, 
        min_sex, 
        max_sex, 
        min_rtc, 
        max_rtc,
CASE  WHEN countofrole=1 THEN 'single' 
      WHEN min_sex=1 AND max_sex =1 THEN 'same-sex couple' 
      WHEN min_sex=2 AND max_sex=2  THEN 'same-sex couple' 
      WHEN min_sex=1 AND max_sex =2 THEN 'mixed-sex couple'
                ELSE 'Other or not stated'       
END adopter_type
FROM fcsq.adopt_appl_rtc;
"""
pydb.create_temp_table(create_adopt_applicant_type_a, "adopt_applicant_type_a")

create_adopt_applicant_type_b = f"""
SELECT case_number, 
        role_model, 
        number_applicants, 
        min_sex, 
        max_sex, 
        min_rtc,
        max_rtc,
        adopter_type,
CASE WHEN (min_rtc Like 'Step%' OR max_rtc Like 'Step%') THEN 'Step parent'
      WHEN (min_rtc Like 'Natural%' OR max_rtc like 'Natural%') THEN 'Other or not stated'  
      WHEN number_applicants > 2 THEN 'Other or not stated'
      WHEN (min_rtc = 'Other' OR max_rtc = 'Other') THEN 'Other or not stated'
      WHEN (min_rtc IN ('Child','Adoption Agency','Central Authority','Home Office','Local Authority','Voluntary Organisation') AND max_rtc IN ('Child','Adoption Agency','Central Authority','Home Office','Local Authority','Voluntary Organisation')) THEN 'Other or not stated'
      WHEN (min_rtc IN ('Child','Adoption Agency','Central Authority','Home Office','Local Authority','Voluntary Organisation') OR max_rtc IN ('Child','Adoption Agency','Central Authority','Home Office','Local Authority','Voluntary Organisation')) THEN 'Sole applicant'
      WHEN number_applicants >1 THEN adopter_type 
      ELSE 'Sole applicant' 
      END adopter 
FROM __temp__.adopt_applicant_type_a;
"""

pydb.create_temp_table(create_adopt_applicant_type_b, "adopt_applicant_type_b")

create_adopt_applicant_type = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_applicant_type
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_applicant_type') AS
SELECT
case_number, 
  role_model, 
  number_applicants, 
  min_sex, 
  max_sex, 
  min_rtc, 
  max_rtc, 
  adopter_type,
CASE WHEN (min_rtc = 'Foster Carer' AND max_rtc = 'Sibling') THEN 'Other or not stated'
        WHEN (adopter_type = 'mixed-sex couple' AND min_rtc = 'Uncle' AND max_rtc = 'Uncle') THEN 'Other or not stated'
        ELSE adopter
        END adopter
FROM __temp__.adopt_applicant_type_b;
"""

pydb.start_query_execution_and_wait(create_adopt_applicant_type);

#### adopt_applicant_type validation

In [31]:
adopt_applicant_type_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_applicant_type")
adopt_applicant_type_count

    count
0  140260

## 12. adopt_child_parties table - Creates a table with the party information from child applicants
<a name="adopt_child_parties"></a>

### Drop the adopt_child_parties table if it already exists and remove its data from the S3 bucket

In [32]:
drop_adopt_child_parties = f"""
DROP TABLE IF EXISTS fcsq.adopt_child_parties;
"""
pydb.start_query_execution_and_wait(drop_adopt_child_parties)

# clean up previous adopt_child_parties files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_child_parties/").delete();

### Create the adopt_child_parties table in Athena

In [33]:
create_adopt_child_parties = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_child_parties
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_child_parties') AS
SELECT case_number, 
        role child_role, 
        party child_party, 
        dob, 
        gender child_sex
FROM fcsq.adoptions_parties
WHERE role_model='CHLDZ'  --filters where the party role_model is a child;
"""

pydb.start_query_execution_and_wait(create_adopt_child_parties);

#### adopt_child_parties validation

In [34]:
adopt_child_parties_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_child_parties")
adopt_child_parties_count

    count
0  137650

# Stage 2 - Applications
<a name="applications"></a>

## 13. adopt_application_4 table - Stage 1 of joining the applications table with information from the applicant type and cases table
<a name="adopt_application_4"></a>

### Drop the adopt_application_4 table if it already exists and remove its data from the S3 bucket

In [35]:
drop_adopt_application_4 = f"""
DROP TABLE IF EXISTS fcsq.adopt_application_4;
"""
pydb.start_query_execution_and_wait(drop_adopt_application_4)

# clean up previous adopt_application_4 files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_application_4/").delete();

### Create the adopt_application_4 table in Athena

#### adopt_application_4 validation

In [36]:
create_adopt_application1 = f"""
SELECT     a1.case_number, 
        a1.event, 
        a1.receipt_date2, 
        a1.app_type, 
        c1.case_app_type, 
        a1.date_of_issue, 
        date_parse(c1.case_issue_date2, '%Y-%m-%d') AS case_issue_date2,
        a1.high_court, 
        c1.contested, 
        b1.number_applicants, 
        b1.min_sex, 
        b1.max_sex, 
        b1.adopter_type, 
        b1.min_rtc,
        b1.max_rtc, 
        b1.adopter, 
        SUBSTR(cast(event as varchar(50)), 1,3) court, 
        ', '||  app_type ||  ',' app_type2,
    
        CASE WHEN a1.date_of_issue <= a1.receipt_date2 
                THEN a1.date_of_issue
              ELSE a1.receipt_date2
              END min_date,
        
        -- AO: Adoption order, CA: Convention adoption order, PFO: Intercountry (NC) Adoption Order, AD: Application dismissed, PF: Proposed Foreign Adoption, SP: Step parent

        CASE WHEN a1.app_type='AO' OR a1.app_type='CA' OR a1.app_type='PFO' OR a1.app_type='AD' OR a1.app_type='PF' OR a1.app_type='SP' THEN 'Adoption'
              WHEN a1.app_type LIKE '%AO%' OR a1.app_type LIKE  '%CA%' OR a1.app_type LIKE '%PF%' OR a1.app_type LIKE '%AD%' OR a1.app_type LIKE '%SP%' THEN 'Adoption+other'
              ELSE 'Non-adoption'
              END adoption

FROM (fcsq.adoptions_applications a1 
LEFT JOIN fcsq.adopt_applicant_type b1 ON a1.case_number = b1.case_number) 
LEFT JOIN fcsq.adoptions_cases c1 ON a1.case_number = c1.case_number;
"""

pydb.create_temp_table(create_adopt_application1,"adopt_application1")

create_adopt_application2 = f"""
SELECT case_number, 
        event, 
        min_date, 
        EXTRACT(YEAR FROM min_date) year,

        CASE WHEN  min_date IS NULL THEN NULL
              WHEN EXTRACT(MONTH FROM min_date) between 1 and 3 THEN 1
              WHEN EXTRACT(MONTH from min_date) between 4 and 6 THEN 2
              WHEN EXTRACT(month from min_date) between 7 and 9 THEN 3
              WHEN EXTRACT(month from min_date) between 10 and 12 THEN 4
              END quarter,

        court, 
        app_type, 
        app_type2, 
        adoption, 
        case_app_type, 
        high_court, 
        contested, 
        number_applicants, 
        min_sex, 
        max_sex, 
        adopter_type, 
        min_rtc, 
        max_rtc, 
        adopter, 
        receipt_date2, 
        date_of_issue, 
        case_issue_date2,

 -- AO: Adoption order, CA: Convention adoption order, PFO: Intercountry (NC) Adoption Order, AD: Application dismissed, PF: Proposed Foreign Adoption, SP: Step parent

        CASE WHEN app_type2 LIKE ', AO%' OR app_type2 LIKE ', AD%' OR app_type2 LIKE ', CA%' OR app_type2 LIKE ', PFO%' OR app_type2 LIKE ', PF%' THEN 'Adoption' 
              ELSE 'N'
              END adoption1 ,

        CASE WHEN app_type2 LIKE ', AO%' OR app_type2 LIKE ', AD%' OR app_type2 LIKE ', SP%' THEN 1
              ELSE 0
              END standard ,

        CASE WHEN app_type2 LIKE '%, CA%' OR app_type2 LIKE '%, CA%'
              THEN 1 
              ELSE 0
              END convention , 

        CASE WHEN app_type2 LIKE '%, PF%'
              THEN 1
                ELSE 0
                END foreign , 

        CASE WHEN app_type2 LIKE '%, PLA%' OR app_type2 LIKE ', FO%'
              THEN 1
              ELSE 0
              END placement , 

        CASE WHEN app_type2 LIKE '%, RPLA%'
              THEN 1
              ELSE 0
              END placement_revoke  , 


        CASE WHEN app_type2 LIKE '%, VPLA%'
              THEN 1
              ELSE 0
              END  placement_vary , 

        CASE WHEN app_type2 LIKE '%, CNO%'
              THEN 1
              ELSE 0
              END contact_s26 , 

        CASE WHEN app_type2 LIKE '%, RCNO%'
              THEN 1
              ELSE 0
              END contact_s26_revoke, 

        CASE WHEN app_type2 LIKE '%, VCNO%'
              THEN 1
              ELSE 0
              END contact_s26_vary , 

        CASE WHEN app_type2 LIKE '%, CCS%' 
              THEN 1
              ELSE 0
              END change_surname , 

        CASE WHEN app_type2 LIKE '%, RUK%'
              THEN 1
              ELSE 0
              END  remove_child_from_uk, 

        CASE WHEN app_type2 LIKE '%, OR%'
              THEN 1
              ELSE 0
              END other_recovery,

        CASE WHEN app_type2 LIKE '%, PT10%'
              THEN 1
              ELSE 0
              END other_part_10, 

        CASE WHEN app_type2 LIKE '%, PT9%'
              THEN 1
              ELSE 0
              END other_part_9, 

        CASE WHEN app_type2 LIKE '%, S84%'
              THEN 1
              ELSE 0
              END other_s84_order, 

        CASE WHEN app_type2 LIKE '%, S88%'
              THEN 1
              ELSE 0
              END other_s88_direction , 

        CASE WHEN app_type2 LIKE '%, S89%'
              THEN 1
              ELSE 0
              END other_s89_order 

FROM __temp__.adopt_application1;
"""

pydb.create_temp_table(create_adopt_application2,"adopt_application2")

create_adopt_application3 = f"""
SELECT application2.case_number, 
        MIN(application2.min_date) app_date, 
        application2.year, 
        application2.quarter, 
        application2.court, 
        application2.app_type, 
        application2.app_type2, 
        application2.case_app_type, 
        application2.adoption, 
        application2.high_court, 
        application2.contested, 
        application2.number_applicants, 
        application2.min_sex, 
        application2.max_sex, 
        application2.adopter_type, 
        application2.min_rtc, 
        application2.max_rtc, 
        application2.adopter
FROM __temp__.adopt_application2 application2
GROUP BY application2.case_number, 
          application2.year, 
          application2.quarter, 
          application2.court, 
          application2.app_type, 
          application2.app_type2, 
          application2.case_app_type, 
          application2.adoption, 
          application2.high_court, 
          application2.contested, 
          application2.number_applicants, 
          application2.min_sex, 
          application2.max_sex, 
          application2.adopter_type, 
          application2.min_rtc, 
          application2.max_rtc, 
          application2.adopter
HAVING (application2.case_number)<>'CV11Z00105';
"""

pydb.create_temp_table(create_adopt_application3,"adopt_application3")

create_adopt_application4 = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_application_4
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_application_4') AS
SELECT application2.case_number, 
        application2.min_date app_date, 
        application2.year, 
        application2.quarter, 
        application2.court, 
        application2.app_type, 
        application2.case_app_type, 
        application2.adoption, 
        application2.high_court, 
        application2.contested, 
        application2.number_applicants, 
        application2.min_sex, 
        application2.max_sex, 
        application2.adopter_type, 
        application2.min_rtc, 
        application2.max_rtc, 
        application2.adopter, 
        application2.standard, 
        application2.convention, 
        application2.foreign, 
        application2.placement, 

        application2.placement_revoke + application2.placement_vary  placement_revoke_or_vary, 

        application2.contact_s26, 

        application2.contact_s26_revoke + application2.contact_s26_vary contact_s26_revoke_or_vary, 
        
        application2.change_surname, 
        application2.remove_child_from_uk, 

        application2.other_recovery+application2.other_part_10+application2.other_part_9+application2.other_s84_order+application2.other_s88_direction+application2.other_s89_order other_order_type


FROM __temp__.adopt_application2 application2;
"""
pydb.start_query_execution_and_wait(create_adopt_application4);

In [37]:
adopt_application_4_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_application_4")
adopt_application_4_count

    count
0  182095

## 14. adopt_application_5 table - Final formatting of adopt_application_4 table
<a name="adopt_application_5"></a>

### Drop the adopt_application_5 table if it already exists and remove its data from the S3 bucket

In [38]:
drop_adopt_application_5 = f"""
DROP TABLE IF EXISTS fcsq.adopt_application_5;
"""
pydb.start_query_execution_and_wait(drop_adopt_application_5)

# clean up previous adopt_application_5 files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_application_5/").delete();

### Create the adopt_application_5 table in Athena

In [39]:
create_adopt_application_5 = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_application_5
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_application_5') AS
SELECT application4.*, 

        CASE WHEN adoption='Adoption' OR adoption='Adoption+other' 
              THEN 'Adoption'
              ELSE ' '
              END AS adoption_cases, 

        CASE WHEN adoption='Non-adoption' OR adoption='Adoption+other'
              THEN 'Non-adoption'
              ELSE '' 
              END AS non_adoption_cases, 

        CASE WHEN adopter IS NULL
              THEN 'Other or not stated'
              ELSE adopter
              END AS adopter_2

FROM fcsq.adopt_application_4 application4;
"""

pydb.start_query_execution_and_wait(create_adopt_application_5);

#### adopt_application_5 validation

In [40]:
adopt_application_5_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_application_5")
adopt_application_5_count

    count
0  182095

## 15. adopt_apps_6_adoptions_only table - Splits the adopt_application_5 table and extracts only the adoption application type cases 
<a name="adopt_apps_6_adoptions_only"></a>

### Drop the adopt_apps_6_adoptions_only table if it already exists and remove its data from the S3 bucket

In [41]:
drop_adopt_apps_6_adoptions_only = f"""
DROP TABLE IF EXISTS fcsq.adopt_apps_6_adoptions_only;
"""
pydb.start_query_execution_and_wait(drop_adopt_apps_6_adoptions_only)

# clean up previous adopt_apps_6_adoptions_only files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_apps_6_adoptions_only/").delete();

### Create the adopt_apps_6_adoptions_only table in Athena

In [42]:
create_adopt_apps_6_adoptions_only = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_apps_6_adoptions_only
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_apps_6_adoptions_only')
AS
SELECT application_5.case_number, 
        application_5.app_date, 
        application_5.year, 
        application_5.quarter,
        application_5.court, 
        application_5.app_type, 
        application_5.case_app_type, 
        application_5.adoption, 
        application_5.high_court, 
        application_5.contested, 
        application_5.number_applicants, 
        application_5.min_sex, 
        application_5.max_sex, 
        application_5.adopter_type,
        application_5.min_rtc, 
        application_5.max_rtc, 
        application_5.adopter, 
        application_5.standard, 
        application_5.convention, 
        application_5.foreign,
        application_5.adoption_cases, 
        application_5.adopter_2,
        
        (application_5.standard + application_5.convention + application_5.foreign) AS adoptions_total 
        
FROM fcsq.adopt_application_5 application_5
WHERE application_5.adoption_cases='Adoption';
"""

pydb.start_query_execution_and_wait(create_adopt_apps_6_adoptions_only);

#### adopt_apps_6_adoptions_only validation

In [43]:
adopt_apps_6_adoptions_only_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_apps_6_adoptions_only")
adopt_apps_6_adoptions_only_count

   count
0  71775

## 16. adopt_apps_6_non_adoptions table - Splits the adopt_application_5 table and extracts only the non-adoption application type cases 
<a name="adopt_apps_6_non_adoptions"></a>

### Drop the adopt_apps_6_non_adoptions table if it already exists and remove its data from the S3 bucket

In [44]:
drop_adopt_apps_6_non_adoptions = f"""
DROP TABLE IF EXISTS fcsq.adopt_apps_6_non_adoptions;
"""
pydb.start_query_execution_and_wait(drop_adopt_apps_6_non_adoptions)

# clean up previous adopt_apps_6_non_adoptions files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_apps_6_non_adoptions/").delete();

### Create the adopt_apps_6_non_adoptions table in Athena

In [45]:
create_adopt_apps_6_non_adoptions = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_apps_6_non_adoptions
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_apps_6_non_adoptions') AS
SELECT application_5.case_number, 
        application_5.app_date, 
        application_5.year, 
        application_5.quarter, 
        application_5.court, 
        application_5.app_type, 
        application_5.case_app_type, 
        application_5.adoption, 
        application_5.high_court, 
        application_5.contested, 
        application_5.number_applicants, 
        application_5.min_sex, 
        application_5.max_sex, 
        application_5.adopter_type, 
        application_5.min_rtc, 
        application_5.max_rtc, 
        application_5.adopter, 
        application_5.placement, 
        application_5.placement_revoke_or_vary, 
        application_5.contact_s26, 
        application_5.contact_s26_revoke_or_vary, 
        application_5.change_surname, 
        application_5.remove_child_from_uk, 
        application_5.other_order_type, 
        application_5.non_adoption_cases, 
        application_5.adopter_2, 
        
        placement+placement_revoke_or_vary+contact_s26+contact_s26_revoke_or_vary+change_surname+remove_child_from_uk+other_order_type AS non_adoptions_total,
        
        REPLACE(app_type,'AO, ','') AS remove_ao
        
FROM fcsq.adopt_application_5 application_5
WHERE application_5.non_adoption_cases='Non-adoption' AND 
(placement+placement_revoke_or_vary+contact_s26+contact_s26_revoke_or_vary+change_surname+remove_child_from_uk+other_order_type)>0;
"""

pydb.start_query_execution_and_wait(create_adopt_apps_6_non_adoptions);

#### adopt_apps_6_non_adoptions validation

In [46]:
adopt_apps_6_non_adoptions_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_apps_6_non_adoptions")
adopt_apps_6_non_adoptions_count

   count
0  89498

## 17. Summary 1: Adoption applications by adopter
<a name="summaries"></a>

In [47]:
distinct_adopter_2 = f"""
SELECT DISTINCT adopter_2  FROM fcsq.adopt_apps_6_adoptions_only;
"""
table1 = pydb.read_sql_query(distinct_adopter_2)
table1

             adopter_2
0     mixed-sex couple
1          Step parent
2       Sole applicant
3      same-sex couple
4  Other or not stated

In [48]:
sum_adopter_types = f"""
SELECT year, 
        quarter,
        SUM(CASE WHEN adopter_2='Other or not stated' THEN adoptions_total ELSE 0 END) other_or_not_stated,
        SUM(CASE WHEN adopter_2='Sole applicant' THEN adoptions_total ELSE 0 END) Sole_applicant,
        SUM(CASE WHEN adopter_2='Step parent' THEN adoptions_total ELSE 0  END) Step_Parent,
        SUM(CASE WHEN adopter_2='mixed-sex couple' THEN adoptions_total ELSE 0 END) mix_sex_couple,
        SUM(CASE WHEN adopter_2='same-sex couple' THEN adoptions_total ELSE 0 END) same_sex_couple,
        SUM(adoptions_total) as adoptions_total
FROM fcsq.adopt_apps_6_adoptions_only WHERE year > 2010 
GROUP BY year, 
          quarter
ORDER BY 1,2;
"""
table1 = pydb.read_sql_query(sum_adopter_types)
table1

    year  quarter  other_or_not_stated  sole_applicant  step_parent  mix_sex_couple  same_sex_couple  adoptions_total
0   2011        1                   28             195          143             945               50             1361
1   2011        2                   27             155          143             777               51             1153
2   2011        3                   11             189          138             783               42             1163
3   2011        4                   19             207          129             780               60             1195
4   2012        1                   16             251          129             965               67             1428
5   2012        2                    8             199          132             882               73             1294
6   2012        3                   18             233          121             883               69             1324
7   2012        4                   17             213           94            1033               91             1448
8   2013        1                   26             255          104            1126              117             1628
9   2013        2                   10             246          123            1167               99             1645
10  2013        3                   22             226           97            1141              104             1590
11  2013        4                   12             236          109            1222              105             1684
12  2014        1                   18             277          103            1270              163             1831
13  2014        2                   14             246          101            1245              133             1739
14  2014        3                   15             244          102            1201              145             1707
15  2014        4                    9             211          101            1093              138             1552
16  2015        1                   17             270          106            1202              145             1740
17  2015        2                   15             248          127             957              141             1488
18  2015        3                   23             266          116            1023              147             1575
19  2015        4                    8             251          109             972              117             1457
20  2016        1                   14             262          104            1042              124             1546
21  2016        2                    9             232          112             958              126             1437
22  2016        3                    6             242          117             956              139             1460
23  2016        4                   14             240          124             904              146             1428
24  2017        1                   26             238          154             888              162             1468
25  2017        2                   10             213          123             785              138             1269
26  2017        3                    8             288          106             832              143             1377
27  2017        4                    9             235          122             799              143             1308
28  2018        1                   10             269          123             748              155             1305
29  2018        2                    5             257          112             746              139             1259
30  2018        3                   13             246          108             722              153             1242
31  2018        4                    9             274           86             767              166             1302
32  2019        1                    6             308          101             761              149             1325
33  2019        2                    7             258           97             725              148             1235
34  2019        3                    7             222           67             704              176             1176
35  2019        4                    8             252           73             732              163             1228
36  2020        1                    6             221           64             681              138             1110
37  2020        2                    9             157           42             499              129              836
38  2020        3                   10             242           62             626              163             1103
39  2020        4                   11             216           39             755              167             1188
40  2021        1                    9             267           67             658              177             1178
41  2021        2                    9             199           86             590              178             1062
42  2021        3                    7             193           68             549              139              956
43  2021        4                    7             190           64             613              183             1057
44  2022        1                   11             207           70             567              164             1019
45  2022        2                   13             194           64             377              112              760

## Summary 2: non-adoption applications by adopter

In [49]:
adopt_non_adopt_summary = f"""
SELECT year, 
        quarter,
        SUM (placement) AS placement_total,
        SUM (placement_revoke_or_vary) AS placement_revoke_or_vary,
        SUM (contact_s26 ) AS contact_s26,
        SUM (contact_s26_revoke_or_vary) AS contact_s26_revoke_or_vary,
        SUM (change_surname)AS change_surname,
        SUM (remove_child_from_uk) AS remove_child_from_uk,
        SUM (other_order_type)AS other_order_type,
        SUM (non_adoptions_total) AS non_adoptions_total_sum

FROM fcsq.adopt_apps_6_non_adoptions 
WHERE year > 2010 /*RB Note (18/11/15): Added this qualifier in as presently results before 2010 not used.*/
GROUP BY year, 
          quarter
ORDER BY year,
          quarter;
"""

table1 = pydb.read_sql_query(adopt_non_adopt_summary)
table1

    year  quarter  placement_total  placement_revoke_or_vary  contact_s26  contact_s26_revoke_or_vary  change_surname  remove_child_from_uk  other_order_type  non_adoptions_total_sum
0   2011        1             1496                        72            7                           1              11                     1                 9                     1597
1   2011        2             1353                        79           15                           1               6                     2                 4                     1460
2   2011        3             1509                        74            6                           1              16                     2                 5                     1613
3   2011        4             1466                        99            5                           1              24                     2                 9                     1606
4   2012        1             1731                       116            2                           2              10                     2                 3                     1866
5   2012        2             1712                        94            5                           4              26                     0                12                     1853
6   2012        3             1838                       166           10                           2              16                     3                 7                     2042
7   2012        4             1804                       146            4                           2               6                     5                 5                     1972
8   2013        1             1716                       231           15                           4              17                     5                 5                     1993
9   2013        2             1892                       259            9                           2              20                     4                 3                     2189
10  2013        3             2080                       272            7                           1              12                     3                 8                     2383
11  2013        4             1494                       242            9                           0              17                     1                 7                     1770
12  2014        1             1296                       314            9                           0              14                     2                13                     1648
13  2014        2             1203                       335            3                           3              12                     4                18                     1578
14  2014        3             1229                       283            6                           0              16                     6                18                     1558
15  2014        4             1216                       287            5                           0              11                     1                34                     1554
16  2015        1             1281                       342            8                           5               7                     2                13                     1658
17  2015        2             1167                       309           14                           1               7                     4                17                     1519
18  2015        3             1375                       301           14                           1               9                     2                27                     1729
19  2015        4             1378                       290           11                           0              11                     3                13                     1706
20  2016        1             1314                       276            7                           0               7                     2                18                     1624
21  2016        2             1391                       243           26                           1              12                     5                13                     1691
22  2016        3             1305                       173            5                           0               9                     1                14                     1507
23  2016        4             1373                       154            8                           3               8                     1                14                     1561
24  2017        1             1501                       174           11                           1              10                     1                13                     1711
25  2017        2             1451                       159            8                           0              10                     2                15                     1645
26  2017        3             1316                       142            2                           0               9                     2                 9                     1480
27  2017        4             1369                       139            1                           0              13                     0                38                     1560
28  2018        1             1363                       154            3                           0              20                     1                21                     1562
29  2018        2             1293                       172            4                           0               3                     2                21                     1495
30  2018        3             1302                       171            5                           1               1                     0                 6                     1486
31  2018        4             1314                       165            6                           2               0                     0                12                     1499
32  2019        1             1230                       203            4                           2               4                     1                23                     1467
33  2019        2             1127                       223            2                           0              10                     1                20                     1383
34  2019        3             1110                       212           16                           0               7                     1                17                     1363
35  2019        4             1050                       184           13                           0               6                     2                21                     1276
36  2020        1             1122                       178            7                           1              17                     0                11                     1336
37  2020        2              981                       196            6                           0               2                     1                14                     1200
38  2020        3              931                       225            3                           0              13                     0                12                     1184
39  2020        4             1098                       217            7                           0              11                     1                 7                     1341
40  2021        1             1077                       182            7                           0               9                     1                13                     1289
41  2021        2             1009                       175            3                           2               4                     1                 0                     1194
42  2021        3              919                       122            8                           0               1                     0                 6                     1056
43  2021        4              889                       122            3                           0               9                     1                 7                     1031
44  2022        1              899                       116            2                           0               7                     1                12                     1037
45  2022        2              777                        82            4                           0               9                     0                13                      885

## Summary 3 - produces a case level table for purposes of case level counts

In [50]:
adopt_application_case_count_a = f"""
SELECT case_number,
        court, 
        MIN(app_date) AS minofapp_date
FROM fcsq.adopt_application_4 
WHERE year > 2010
GROUP BY case_number,court
ORDER BY 1,2;
"""
pydb.create_temp_table(adopt_application_case_count_a,"adopt_application_case_count_a")

In [51]:
adopt_application_case_count_b = f"""
SELECT case_number, 
        minofapp_date, 
        CAST(EXTRACT(YEAR FROM minofapp_date) as varchar(3)) || ' - ' ||
        
        (CASE WHEN (EXTRACT (MONTH FROM minofapp_date)) BETWEEN 1 AND 3  THEN CAST(1 as varchar(3))
              WHEN (EXTRACT (MONTH FROM minofapp_date)) BETWEEN 4 AND 6 THEN CAST(2 as varchar(3))
              WHEN (EXTRACT (MONTH FROM minofapp_date)) BETWEEN 7 AND 9 THEN CAST(3 as varchar(3))
              WHEN (EXTRACT (MONTH FROM minofapp_date)) BETWEEN 10 AND 12 THEN CAST(4 as varchar(3))
              END) quarter

FROM __temp__.adopt_application_case_count_a;
"""
pydb.create_temp_table(adopt_application_case_count_b,"adopt_application_case_count_b")

In [52]:
adopt_apps_case_count_total = f"""
SELECT quarter, 
        COUNT(case_number) count_of_case
FROM __temp__.adopt_application_case_count_b
GROUP BY quarter
ORDER BY quarter; 
"""


pydb.create_temp_table(adopt_apps_case_count_total,"adopt_apps_case_count_total")

## 18. adopt_adopt_only_case_count summary - Creates a table with the total case counts for adoption case types by quarter
<a name="adopt_adopt_only_case_count"></a>

In [53]:
adopt_adopt_only_case_count_a = f"""
SELECT case_number, 
        MIN(app_date) AS minofapp_date 
FROM fcsq.adopt_apps_6_adoptions_only
WHERE year > 2010
GROUP BY case_number, court;
"""
pydb.create_temp_table(adopt_adopt_only_case_count_a,"adopt_adopt_only_case_count_a")

adopt_adopt_only_case_count_b = f"""
SELECT case_number, 
        minofapp_date, 
        CAST(EXTRACT(YEAR FROM (minofapp_date)) as varchar(3)) || ' - ' ||

        (CASE WHEN (EXTRACT (MONTH FROM minofapp_date)) BETWEEN 1 AND 3  THEN CAST(1 as varchar(3))
              WHEN (EXTRACT (MONTH FROM minofapp_date)) BETWEEN 4 AND 6 THEN CAST(2 as varchar(3))
              WHEN (EXTRACT (MONTH FROM minofapp_date)) BETWEEN 7 AND 9 THEN CAST(3 as varchar(3))
              WHEN (EXTRACT (MONTH FROM minofapp_date)) BETWEEN 10 AND 12 THEN CAST(4 as varchar(3))
              END) quarter

FROM __temp__.adopt_adopt_only_case_count_a;
"""
pydb.create_temp_table(adopt_adopt_only_case_count_b,"adopt_adopt_only_case_count_b")

adopt_only_case_count_total = f"""
SELECT quarter, 
        COUNT (case_number) AS count_of_case
FROM __temp__.adopt_adopt_only_case_count_b
GROUP BY quarter
ORDER BY quarter;
"""
pydb.create_temp_table(adopt_only_case_count_total,"adopt_adopt_only_case_count_total")

## The next couple of queries are here to find the court level data for the court level/DFJ CSV file. Currently these are not used for FCSQ

In [54]:
applications_court_level = f"""
SELECT year, 
        quarter, 
        court, 
        COUNT(*) n 
FROM fcsq.adopt_apps_6_adoptions_only
WHERE year>2010
GROUP BY year, 
          quarter, 
          court
ORDER BY 1,2,3;
"""

pydb.read_sql_query(applications_court_level)

      year  quarter court   n
0     2011        1   100  90
1     2011        1   127  37
2     2011        1   130  14
3     2011        1   139  15
4     2011        1   150  47
...    ...      ...   ...  ..
3593  2022        2   380  14
3594  2022        2   384   3
3595  2022        2   386  11
3596  2022        2   388   7
3597  2022        2   554  10

[3598 rows x 4 columns]

In [55]:
#Secondly the applications case level court level file
adopt_application_case_count_c = f"""
SELECT 
  case_number, 
  MIN(app_date) AS minofapp_date,
  court 
FROM fcsq.adopt_apps_6_adoptions_only 
GROUP BY case_number,
          court;
"""

pydb.create_temp_table(adopt_application_case_count_c,"adopt_application_case_count_c")

adopt_application_case_count_d = f"""
SELECT case_number, 
        EXTRACT(YEAR FROM (minofapp_date)) year,
        CAST(EXTRACT(YEAR FROM (minofapp_date)) as varchar(3)) || ' - ' ||

        (CASE WHEN (EXTRACT (MONTH FROM minofapp_date)) BETWEEN 1 AND 3  THEN CAST(1 as varchar(3))
              WHEN (EXTRACT (MONTH FROM minofapp_date)) BETWEEN 4 AND 6 THEN CAST(2 as varchar(3))
              WHEN (EXTRACT (MONTH FROM minofapp_date)) BETWEEN 7 AND 9 THEN CAST(3 as varchar(3))
              WHEN (EXTRACT (MONTH FROM minofapp_date)) BETWEEN 10 AND 12 THEN CAST(4 as varchar(3))
              END) quarter,
        minofapp_date,
        court 
FROM __temp__.adopt_application_case_count_c;
"""

pydb.create_temp_table(adopt_application_case_count_d,"adopt_application_case_count_d")


final_query = f"""
SELECT year, 
        quarter, 
        court, 
        COUNT(*) n 
FROM __temp__.adopt_application_case_count_d
WHERE year > 2010
GROUP BY year, 
          quarter, 
          court
ORDER BY year, 
          quarter, 
          court;
"""

pydb.read_sql_query(final_query)

      year   quarter court   n
0     2011  2011 - 1   100  90
1     2011  2011 - 1   127  37
2     2011  2011 - 1   130  14
3     2011  2011 - 1   139  15
4     2011  2011 - 1   150  47
...    ...       ...   ...  ..
3593  2022  2022 - 2   380  14
3594  2022  2022 - 2   384   3
3595  2022  2022 - 2   386  11
3596  2022  2022 - 2   388   7
3597  2022  2022 - 2   554  10

[3598 rows x 4 columns]

# Stage 3 - Disposals
<a name="disposals"></a>

## 19. adopt_order_type table - Creates a table which extracts the type of order from the adopt_disposals_fields table where the field_model shows type of order
<a name="adopt_order_type"></a>

### Drop the adopt_order_type table if it already exists and remove its data from the S3 bucket

In [57]:

drop_adopt_order_type = f"""
DROP TABLE IF EXISTS fcsq.adopt_order_type;
"""
pydb.start_query_execution_and_wait(drop_adopt_order_type)

# clean up previous adopt_order_type files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_order_type/").delete();

### Create the adopt_order_type table in Athena

In [58]:
create_adopt_order_type = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_order_type
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_order_type') AS
SELECT event, 
        field_model, 
        value 
FROM fcsq.adoptions_disposal_fields
WHERE field_model='A73_1' -- These are all the different event codes which give the type of order
  OR field_model='A74_2'
  OR field_model='A80_4' 
  OR field_model='G63_1' 
  OR field_model='ORDNOM_5' 
  OR field_model='ORDREF_5' 
  OR field_model='A81_5';
"""

pydb.start_query_execution_and_wait(create_adopt_order_type);

#### adopt_order_type validation

In [59]:
adopt_order_type_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_order_type")
adopt_order_type_count

    count
0  364025

## 20. adopt_disposals_type table - Creates a table which extracts the type of disposal by matching the adopt_disposals table to the adopt_disposals_fields table where the field_model shows type of disposal
<a name="adopt_disposals_type"></a>

### Drop the adopt_disposals_type table if it already exists and remove its data from the S3 bucket

In [60]:
drop_adopt_disposals_type = f"""
DROP TABLE IF EXISTS fcsq.adopt_disposals_type;
"""
pydb.start_query_execution_and_wait(drop_adopt_disposals_type)

# clean up previous adopt_disposals_type files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_disposals_type/").delete();

### Create the adopt_disposals_type table in Athena

In [61]:
create_adopt_disposals_type = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_disposals_type
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_disposals_type') AS

SELECT disposals.case_number, 
        disposals.event, 
        disposals.receipt_date2, 
        disposals.event_model, 
        disposal_fields.field_model, 
        disposal_fields.value AS order_type, 
        EXTRACT(YEAR FROM (disposals.receipt_date2)) AS year, 

        CASE WHEN EXTRACT(MONTH FROM (disposals.receipt_date2))<4 THEN 1
              WHEN EXTRACT(MONTH FROM(disposals.receipt_date2)) <7 THEN 2
              WHEN EXTRACT( MONTH FROM (disposals.receipt_date2))<10 THEN 3
              ELSE 4
              END AS quarter

FROM fcsq.adoptions_disposals disposals 
  LEFT JOIN fcsq.ADOPTIONS_DISPOSAL_FIELDS disposal_fields 
  ON disposals.event = disposal_fields.event

WHERE (((disposals.event_model)='A70' --Placement order
    OR (disposals.event_model)='A71' --Order for Variation of a Placement Order
    OR (disposals.event_model)='A72' --Order for Revocation of a Placement Order
    OR (disposals.event_model)='A75' --Recovery Order
    OR (disposals.event_model)='A79') --Direction under s.88
    AND ((disposal_fields.field_model) LIKE '%_JG'))  --Name and title of judge
  OR (((disposals.event_model)='A76') -- Adoption order
    AND ((disposal_fields.field_model)='A76_12')) -- Child placed by Adoption Agency?
  OR (((disposals.event_model)='A77') --Convention Adoption Order
    AND ((disposal_fields.field_model)='A77_12')) --Child placed by Adoption Agency?
  OR (((disposals.event_model)='A78') --Order under s.84
    AND ((disposal_fields.field_model)='A78_15'))  --Child placed by Adoption Agency?
  OR (((disposals.event_model)='A12' --Freeing order
    OR (disposals.event_model)='A13' --Order revoking freeing order
    OR (disposals.event_model)='A15') --Adoption order
    AND ((disposal_fields.field_model) LIKE '%_FO')) --Final order
  OR (((disposals.event_model)='A73' --Contact Order/Order for Variation/Revocation of a Contact Order
    OR (disposals.event_model)='G63') --Application Withdrawn
    AND ((disposal_fields.field_model) LIKE '%_1'))
  OR (((disposals.event_model)='A74') --Permission to Change Child's Surname/Remove Child from the UK
    AND ((disposal_fields.field_model)='A74_2')) --Type of order
  OR (((disposals.event_model)='A80')  --Order under s.89
    AND ((disposal_fields.field_model)='A80_4')) --Type of order
  OR (((disposals.event_model)='ORDNOM' --Order not made
    OR (disposals.event_model)='ORDREF') --Order refused
    AND ((disposal_fields.field_model) LIKE '%_5')) --Type of order; 
"""

pydb.start_query_execution_and_wait(create_adopt_disposals_type);

#### adopt_disposals_type validation

In [62]:
adopt_disposals_type_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_disposals_type")
adopt_disposals_type_count

    count
0  241904

## 21. adopt_country_of_birth table - Extracts the child's country of birth from the disposal_fields table
<a name="adopt_country_of_birth"></a>

### Drop the adopt_country_of_birth table if it already exists and remove its data from the S3 bucket

In [63]:
drop_adopt_country_of_birth = f"""
DROP TABLE IF EXISTS fcsq.adopt_country_of_birth;
"""
pydb.start_query_execution_and_wait(drop_adopt_country_of_birth)

# clean up previous adopt_country_of_birth files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_country_of_birth/").delete();

### Create the adopt_country_of_birth table in Athena

In [64]:
create_adopt_country_of_birth = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_country_of_birth
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_country_of_birth') AS
SELECT disposal_fields.event, 
        disposal_fields.field_model, 
        disposal_fields.value
FROM fcsq.ADOPTIONS_DISPOSAL_FIELDS disposal_fields
WHERE (((disposal_fields.field_model)='A70_5' --These are all the field models for country of birth
    OR (disposal_fields.field_model)='A76_2' 
    OR (disposal_fields.field_model)='A77_10' 
    OR (disposal_fields.field_model)='A78_13' 
    OR ((disposal_fields.field_model)='A12_1' 
    OR (disposal_fields.field_model)='A15_1'))); 
"""

pydb.start_query_execution_and_wait(create_adopt_country_of_birth);

#### adopt_country_of_birth validation

In [65]:
adopt_country_of_birth_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_country_of_birth")
adopt_country_of_birth_count

   count
0   4465

## 22. adopt_disposals_with_child table - Creates a table which matches the disposals data with the child information
<a name="adopt_disposals_with_child"></a>

### Drop the adopt_disposals_with_child table if it already exists and remove its data from the S3 bucket

In [66]:
drop_adopt_disposals_with_child = f"""
DROP TABLE IF EXISTS fcsq.adopt_disposals_with_child;
"""
pydb.start_query_execution_and_wait(drop_adopt_disposals_with_child)

# clean up previous adopt_disposals_with_child files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_disposals_with_child/").delete();

### Create the adopt_disposals_with_child table in Athena

In [67]:
create_adopt_disposals2 =f"""
SELECT disposals1.case_number, 
        disposals1.event, 
        disposals1.receipt_date2, 
        disposals1.event_model, 
        order_type.field_model, 
        order_type.value AS order_type, 
        country_of_birth.value AS country_of_birth, 
        EXTRACT(YEAR FROM (disposals1.receipt_date2)) AS year, 

        CASE WHEN EXTRACT(Month FROM (disposals1.receipt_date2)) <4 THEN 1
              WHEN EXTRACT(Month FROM (disposals1.receipt_date2)) <7 THEN 2
              WHEN EXTRACT(Month FROM (disposals1.receipt_date2))<10 THEN 3
              ELSE 4
              END AS quarter
              
FROM fcsq.adoptions_disposals disposals1 
  LEFT JOIN fcsq.adopt_order_type order_type 
    ON disposals1.event = Order_type.event 
  LEFT JOIN fcsq.adopt_country_of_birth country_of_birth 
    ON disposals1.event = country_of_birth.event
WHERE (((disposals1.event_model)<>'G63' --Application withdrawn
    AND (disposals1.event_model)<>'ORDNOM'  --Order not made
    AND (disposals1.event_model)<>'ORDREF')) --Order refused
  OR (((disposals1.case_number) LIKE '____A%' 
      OR (disposals1.case_number) LIKE '____Z%') 
    AND ((disposals1.event_model)='G63' 
      OR (disposals1.event_model)='ORDNOM' 
      OR (disposals1.event_model)='ORDREF'));
"""

pydb.create_temp_table(create_adopt_disposals2,"adopt_disposals2")


create_adopt_disposals3 = f"""
SELECT disposals2.case_number, 
        disposals2.year, 
        disposals2.quarter, 
        disposals2.event, 
        disposals2.receipt_date2, 
        disposals2.event_model, 
        disposals2.field_model, 
        disposals2.order_type, 
        lower(disposals2.country_of_birth) as country_of_birth, 
        applicant_type.number_applicants,
        applicant_type.min_sex, 
        applicant_type.max_sex, 
        applicant_type.adopter_type, 
        applicant_type.min_rtc, 
        applicant_type.max_rtc, 
        applicant_type.adopter 
        
FROM __temp__.adopt_disposals2 disposals2 
  LEFT JOIN fcsq.adopt_applicant_type applicant_type
    ON disposals2.case_number = applicant_type.case_number;
"""
pydb.create_temp_table(create_adopt_disposals3,"adopt_disposals3")

create_adopt_disposals4 = f"""
SELECT disposals3.case_number, 
        substr(CAST(disposals3.event as varchar(3)),1,3) AS court, 
        disposals3.year, 
        disposals3.quarter,
        MIN(disposals3.receipt_date2) AS receipt_date, 
        disposals3.event_model, 
        disposals3.field_model, 
        disposals3.order_type, 
        MAX(disposals3.country_of_birth) AS country_of_birth_new,
        disposals3.number_applicants,
        disposals3.min_sex, 
        disposals3.max_sex, 
        disposals3.adopter_type, 
        disposals3.min_rtc, 
        disposals3.max_rtc, 
        disposals3.adopter
        
FROM __temp__.adopt_disposals3 disposals3
GROUP BY disposals3.case_number, 
          substr(CAST(disposals3.event as varchar(3)),1,3), 
          disposals3.year, 
          disposals3.quarter, 
          disposals3.event_model, 
          disposals3.field_model,
          disposals3.order_type, 
          disposals3.number_applicants, 
          disposals3.min_sex, 
          disposals3.max_sex, 
          disposals3.adopter_type, 
          disposals3.min_rtc, 
          disposals3.max_rtc, 
          disposals3.adopter
HAVING (((disposals3.case_number)<>'CV11Z00105'))
ORDER BY disposals3.case_number;
"""

pydb.create_temp_table(create_adopt_disposals4,"adopt_disposals4")

create_adopt_disposals4a = f"""
SELECT disposals4.case_number, 
        MIN(disposals4.court)AS court_new, 
        disposals4.year, 
        disposals4.quarter,
        disposals4.receipt_date, 
        disposals4.event_model, 
        disposals4.field_model, 
        disposals4.order_type, 
        disposals4.country_of_birth_new,
        disposals4.number_applicants,
        disposals4.min_sex, 
        disposals4.max_sex, 
        disposals4.adopter_type, 
        disposals4.min_rtc, 
        disposals4.max_rtc, 
        disposals4.adopter
        
FROM __temp__.adopt_disposals4 disposals4
GROUP BY disposals4.case_number,  
        disposals4.year, 
        disposals4.quarter,
        disposals4.receipt_date, 
        disposals4.event_model, 
        disposals4.field_model, 
        disposals4.order_type, 
        disposals4.country_of_birth_new,
        disposals4.number_applicants,
        disposals4.min_sex, 
        disposals4.max_sex, 
        disposals4.adopter_type, 
        disposals4.min_rtc, 
        disposals4.max_rtc, 
        disposals4.adopter
ORDER BY disposals4.case_number;
"""

pydb.create_temp_table(create_adopt_disposals4a,"adopt_disposals4a")

create_adopt_disposals_with_child = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_disposals_with_child
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_disposals_with_child') AS
SELECT disposals4a.*, 
        child_parties.dob, 
        child_parties.child_sex, 
        date_diff('day',dob,receipt_date)/365.25 AS child_age 
FROM __temp__.adopt_disposals4a Disposals4a
  LEFT JOIN fcsq.adopt_child_parties child_parties
    ON disposals4a.case_number = child_parties.case_number;
"""

pydb.start_query_execution_and_wait(create_adopt_disposals_with_child);

#### adopt_disposals_with_child validation

In [68]:
adopt_disposals_with_child_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_disposals_with_child")
adopt_disposals_with_child_count

    count
0  347032

## 23. adopt_disposals5 table - Formats the adopt_disposals_with_child table 
<a name="adopt_disposals5"></a>

### Drop the adopt_disposals5 table if it already exists and remove its data from the S3 bucket

In [69]:
drop_adopt_disposals5 = f"""
DROP TABLE IF EXISTS fcsq.adopt_disposals5;
"""
pydb.start_query_execution_and_wait(drop_adopt_disposals5)

# clean up previous adopt_disposals5 files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_disposals5/").delete();

### Create the adopt_disposals5 table in Athena

In [70]:
create_adopt_disposals5 = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_disposals5
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_disposals5') AS
SELECT disposals_with_child.case_number, 
        disposals_with_child.court_new AS court, 
        disposals_with_child.year, 
        disposals_with_child.quarter, 
        disposals_with_child.receipt_date, 
        disposals_with_child.event_model, 
        disposals_with_child.field_model, 
        disposals_with_child.order_type, 
        disposals_with_child.country_of_birth_new AS country_of_birth, 
        disposals_with_child.number_applicants, 
        disposals_with_child.adopter_type, 
        disposals_with_child.adopter,
        max_rtc, 
        max_sex, 
        min_rtc, 
        min_sex, 
        child_sex,

        CASE WHEN disposals_with_child.child_age IS NULL THEN 'Unknown'
              WHEN disposals_with_child.child_age<0 THEN 'Other'
              WHEN disposals_with_child.child_age<1 THEN '<1 year'
              WHEN disposals_with_child.child_age<5 THEN '1-4 years'
              WHEN disposals_with_child.child_age<10 THEN'5-9 years'
              WHEN disposals_with_child.child_age<15 THEN '10-14 years'
              WHEN disposals_with_child.child_age<18 THEN '15-17 years'
              ELSE 'Other'
              END AS age_band, 

        disposals_with_child.child_age, 

        CASE WHEN event_model='A15' --Adoption order
                OR event_model='A76' --Adoption order
                OR event_model='A77' --Convention adoption order
                THEN 'Adoption'
              WHEN event_model='G63' --Application withdrawn
                OR event_model='ORDREF' --Order refused
                OR event_model='ORDNOM' --Order not made
                THEN 'No order made'
              ELSE 'Non-adoption'
              END  AS adoption, 

        CASE WHEN event_model='A77'     
                THEN 'Convention'
              WHEN country_of_birth_new <>'' 
                And event_model='A76' 
                THEN '?Foreign?'
              WHEN event_model='A76' 
                OR event_model='A15' 
                THEN 'Standard'
              WHEN event_model='A12' 
                OR event_model='A70' 
                THEN 'Placement'
              WHEN event_model='A13' 
                OR event_model='A71' 
                OR event_model='A72' 
                THEN 'Placement_revoke_or_vary'
              WHEN order_type='CNO' 
                THEN 'Contact_s26'
              WHEN order_type='RCNO' 
                OR order_type='VCNO' 
                OR order_type='OFNC' 
                THEN 'Contact_s26_revoke_or_vary'
              WHEN order_type='CCS' 
                THEN 'Change_surname'
              WHEN order_type='RUK' 
                THEN 'Remove_child_from_UK'
              WHEN event_model='A75' 
                OR event_model='A78' 
                OR event_model='A79' 
                OR event_model='A80' 
                THEN 'Other_order_type'
              ELSE ''
              END AS Type,

        CASE WHEN adopter IS NULL 
              THEN 'Other or not stated'
              ELSE adopter
              END AS adopter_2

FROM fcsq.adopt_disposals_with_child disposals_with_child
WHERE (disposals_with_child.event_model<>'A81') 
ORDER BY disposals_with_child.receipt_date;
"""

pydb.start_query_execution_and_wait(create_adopt_disposals5);

#### adopt_disposals5 validation

In [71]:
adopt_disposals5_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_disposals5")
adopt_disposals5_count

    count
0  163314

## 24. adopt_disposals5_adoption table - Splits the adopt_disposals5 table extracting just adoption type cases
<a name="adopt_disposals5_adoption"></a>

### Drop the adopt_disposals5_adoption table if it already exists and remove its data from the S3 bucket

In [72]:
drop_adopt_disposals5_adoption = f"""
DROP TABLE IF EXISTS fcsq.adopt_disposals5_adoption;
"""
pydb.start_query_execution_and_wait(drop_adopt_disposals5_adoption)

# clean up previous adopt_disposals5_adoption files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_disposals5_adoption/").delete();

### Create the adopt_disposals5_adoption table in Athena

In [73]:
create_adopt_disposals5_adoption = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_disposals5_adoption
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_disposals5_adoption') AS
SELECT disposals5.case_number, 
        disposals5.court, 
        disposals5.year, 
        disposals5.quarter, 
        disposals5.receipt_date, 
        disposals5.event_model, 
        disposals5.country_of_birth, 
        disposals5.number_applicants, 
        disposals5.adopter_type, 
        disposals5.adopter, 

        CASE WHEN child_sex=1 THEN'M'
              WHEN child_sex=2 THEN'F'
              ELSE 'U'
              END AS ch_sex, 

        disposals5.age_band, 
        disposals5.adoption, 
        disposals5.child_sex, 
        disposals5.type, 
        disposals5.adopter_2 

FROM fcsq.adopt_disposals5 disposals5
WHERE disposals5.adoption='Adoption';
"""

pydb.start_query_execution_and_wait(create_adopt_disposals5_adoption);

#### adopt_disposals5_adoption validation

In [74]:
adopt_disposals5_adoption_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_disposals5_adoption")
adopt_disposals5_adoption_count

   count
0  84636

## 25. adopt_disposals5_non_adoption table - Splits the adopt_disposals5 table extracting just non-adoption type cases
<a name="adopt_disposals5_non_adoption"></a>

### Drop the adopt_disposals5_non_adoption table if it already exists and remove its data from the S3 bucket

In [75]:
drop_adopt_disposals5_non_adoption = f"""
DROP TABLE IF EXISTS fcsq.adopt_disposals5_non_adoption;
"""
pydb.start_query_execution_and_wait(drop_adopt_disposals5_non_adoption)

# clean up previous adopt_disposals5_non_adoption files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_disposals5_non_adoption/").delete();

### Create the adopt_disposals5_non_adoption table in Athena

In [76]:
create_adopt_disposals5_non_adoption = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_disposals5_non_adoption
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_disposals5_non_adoption') AS
SELECT disposals5.case_number, 
        disposals5.court, 
        disposals5.year, 
        disposals5.quarter, 
        disposals5.receipt_date,
        disposals5.event_model, 
        disposals5.order_type, 
        disposals5.adoption, 
        disposals5.type, 
        disposals5.adopter_2,

        CASE WHEN type='Placement' THEN type
              ELSE 'Other Order'
              END  placement

FROM fcsq.adopt_disposals5 disposals5
WHERE (disposals5.event_model<>'A81') --A81: Blank Order (Adoption and Children Act (General))
  AND (disposals5.adoption='Non-adoption');
"""

pydb.start_query_execution_and_wait(create_adopt_disposals5_non_adoption);

#### adopt_disposals5_non_adoption validation

In [77]:
adopt_disposals5_non_adoption_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_disposals5_non_adoption")
adopt_disposals5_non_adoption_count

   count
0  72041

## 26. adopt_disposals5_non_orders table - Splits the adopt_disposals5 table extracting just cases where no order was made
<a name="adopt_disposals5_non_orders"></a>

### Drop the adopt_disposals5_non_orders table if it already exists and remove its data from the S3 bucket

In [78]:
drop_adopt_disposals5_non_orders = f"""
DROP TABLE IF EXISTS fcsq.adopt_disposals5_non_orders;
"""
pydb.start_query_execution_and_wait(drop_adopt_disposals5_non_orders)

# clean up previous adopt_disposals5_non_orders files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_disposals5_non_orders/").delete();

### Create the adopt_disposals5_non_orders table in Athena

In [79]:
create_adopt_disposals5_non_orders = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_disposals5_non_orders
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_disposals5_non_orders') AS
SELECT disposals5.case_number, 
        disposals5.court, 
        disposals5.year, 
        disposals5.quarter, 
        disposals5.receipt_date, 
        disposals5.event_model,
        disposals5.adoption, 
        disposals5.adopter_2 
FROM fcsq.adopt_disposals5 disposals5
WHERE disposals5.adoption='No order made';
"""

pydb.start_query_execution_and_wait(create_adopt_disposals5_non_orders);

#### adopt_disposals5_non_orders validation

In [80]:
adopt_disposals5_non_orders_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_disposals5_non_orders")
adopt_disposals5_non_orders_count

   count
0   6637

In [81]:
#Summary 4
summary4 = f"""
SELECT year, 
        quarter, 
        SUM(CASE WHEN adopter_2 ='Other or not stated' THEN 1 ELSE 0 END) other_or_not_stated,
        SUM(CASE WHEN adopter_2 ='Sole applicant' THEN 1 ELSE 0 END) sole_applicant,
        SUM(CASE WHEN adopter_2 ='Step parent' THEN 1 ELSE 0 END) step_parent,
        SUM(CASE WHEN adopter_2 ='mixed-sex couple' THEN 1 ELSE 0 END) mixed_sex_couple,
        SUM(CASE WHEN adopter_2 ='same-sex couple' THEN 1 ELSE 0 END) same_sex_couple,
        COUNT(*) adopter_2_total
from fcsq.adopt_disposals5_adoption
where year > 2010
GROUP BY year, 
          quarter
ORDER BY year,
          quarter;
"""

pydb.read_sql_query(summary4)

    year  quarter  other_or_not_stated  sole_applicant  step_parent  mixed_sex_couple  same_sex_couple  adopter_2_total
0   2011        1                   25             185          112               723               44             1089
1   2011        2                   12             168          122               854               55             1211
2   2011        3                   33             120          153               821               42             1169
3   2011        4                   14             202          144               824               50             1234
4   2012        1                   13             192          122               823               60             1210
5   2012        2                   12             225          101               864               54             1256
6   2012        3                   10             205          133               928               66             1342
7   2012        4                   16             244          125               967               99             1451
8   2013        1                   10             197           99               947               84             1337
9   2013        2                   27             234           99              1152              118             1630
10  2013        3                   13             228          104              1128              100             1573
11  2013        4                   14             227          111              1096               86             1534
12  2014        1                   10             222           93              1178              137             1640
13  2014        2                    9             238           87              1231              121             1686
14  2014        3                   17             258           84              1248              161             1768
15  2014        4                   17             223          106              1188              119             1653
16  2015        1                    6             231          100              1133              146             1616
17  2015        2                   13             216          106              1156              137             1628
18  2015        3                   11             263          109               948              144             1475
19  2015        4                   20             225          122               994              114             1475
20  2016        1                    7             253          107              1039              159             1565
21  2016        2                    9             241          105              1020              117             1492
22  2016        3                   10             242          102               977              135             1466
23  2016        4                    7             215          100               872              108             1302
24  2017        1                   12             222          115               922              152             1423
25  2017        2                   17             214          127               898              131             1387
26  2017        3                    8             215          108               821              155             1307
27  2017        4                   10             250          126               790              145             1321
28  2018        1                    4             244          100               820              124             1292
29  2018        2                   11             226          117               744              177             1275
30  2018        3                    4             224           84               711              148             1171
31  2018        4                    5             268          107               684              124             1188
32  2019        1                    9             244           97               828              154             1332
33  2019        2                    6             240           78               714              166             1204
34  2019        3                    4             260           84               766              156             1270
35  2019        4                    4             249           79               703              171             1206
36  2020        1                    5             204           63               658              170             1100
37  2020        2                    3             128           49               359               52              591
38  2020        3                   11             188           48               646              137             1030
39  2020        4                   10             215           64               638              184             1111
40  2021        1                    7             205           52               746              167             1177
41  2021        2                    7             254           51               694              155             1161
42  2021        3                    5             236           74               616              179             1110
43  2021        4                    4             174           67               576              162              983
44  2022        1                    6             186           55               498              149              894
45  2022        2                    2             153           42               372              113              682

In [82]:
summary5 = f"""
SELECT year, 
        quarter, 
        COUNT (case_number) AS count_of_case

FROM fcsq.adopt_disposals5_adoption
GROUP BY year, quarter
ORDER BY year, quarter;
"""
pydb.read_sql_query(summary5)

    year  quarter  count_of_case
0   1999        3             12
1   1999        4             71
2   2000        1            233
3   2000        2            476
4   2000        3            633
..   ...      ...            ...
87  2021        2           1161
88  2021        3           1110
89  2021        4            983
90  2022        1            894
91  2022        2            682

[92 rows x 3 columns]

In [83]:
summary6 = f"""
SELECT year, 
        quarter,
        SUM(CASE WHEN ch_sex='F' THEN 1 ELSE 0 END) f,
        SUM(CASE WHEN ch_sex='M' THEN 1 ELSE 0 END) m,
        SUM(CASE WHEN ch_sex='U' THEN 1 ELSE 0 END) u,
        COUNT(*) total
from fcsq.adopt_disposals5_adoption
WHERE year > 2010
GROUP BY year, quarter
ORDER BY year,quarter;
"""
pydb.read_sql_query(summary6)

    year  quarter    f    m   u  total
0   2011        1  538  539  12   1089
1   2011        2  611  600   0   1211
2   2011        3  583  584   2   1169
3   2011        4  630  604   0   1234
4   2012        1  585  624   1   1210
5   2012        2  623  633   0   1256
6   2012        3  663  679   0   1342
7   2012        4  736  715   0   1451
8   2013        1  668  666   3   1337
9   2013        2  823  807   0   1630
10  2013        3  803  770   0   1573
11  2013        4  790  744   0   1534
12  2014        1  815  825   0   1640
13  2014        2  833  853   0   1686
14  2014        3  860  898  10   1768
15  2014        4  796  857   0   1653
16  2015        1  772  844   0   1616
17  2015        2  807  821   0   1628
18  2015        3  700  775   0   1475
19  2015        4  730  745   0   1475
20  2016        1  702  863   0   1565
21  2016        2  714  778   0   1492
22  2016        3  729  737   0   1466
23  2016        4  611  690   1   1302
24  2017        1  735  688   0   1423
25  2017        2  692  695   0   1387
26  2017        3  620  687   0   1307
27  2017        4  641  679   1   1321
28  2018        1  615  676   1   1292
29  2018        2  668  607   0   1275
30  2018        3  565  606   0   1171
31  2018        4  548  640   0   1188
32  2019        1  653  679   0   1332
33  2019        2  597  606   1   1204
34  2019        3  630  639   1   1270
35  2019        4  601  605   0   1206
36  2020        1  528  572   0   1100
37  2020        2  305  286   0    591
38  2020        3  486  544   0   1030
39  2020        4  545  563   3   1111
40  2021        1  583  593   1   1177
41  2021        2  564  596   1   1161
42  2021        3  524  586   0   1110
43  2021        4  498  485   0    983
44  2022        1  423  471   0    894
45  2022        2  335  347   0    682

In [84]:
summary7 = f"""
SELECT year, 
        quarter,
        SUM(CASE WHEN age_band ='<1 year' THEN 1 ELSE 0 END) less_1_year,
        SUM(CASE WHEN age_band='1-4 years' THEN 1 ELSE 0 END) years_1_4,
        SUM(CASE WHEN age_band ='5-9 years' THEN 1 ELSE 0 END) years_5_9,
        SUM(CASE WHEN age_band ='10-14 years' THEN 1 ELSE 0 END) years_10_14,
        SUM(CASE WHEN age_band ='15-17 years' THEN 1 ELSE 0 END) year_15_17,
        SUM(CASE WHEN age_band = 'Other' THEN 1 ELSE 0 END) other,
        SUM(CASE WHEN age_band = 'Unknown' THEN 1 ELSE 0 END) unknown,
        COUNT(*) total
FROM fcsq.adopt_disposals5_adoption
WHERE year > 2010
GROUP BY year, quarter
ORDER BY year,quarter;

"""
pydb.read_sql_query(summary7)

    year  quarter  less_1_year  years_1_4  years_5_9  years_10_14  year_15_17  other  unknown  total
0   2011        1           26        685        247           85          31      3       12   1089
1   2011        2           20        777        268          120          22      4        0   1211
2   2011        3           23        671        304          129          36      4        2   1169
3   2011        4           21        790        255          121          42      5        0   1234
4   2012        1           33        745        285           98          45      3        1   1210
5   2012        2           25        777        288          124          35      7        0   1256
6   2012        3           20        834        323          122          39      4        0   1342
7   2012        4           43        928        344           96          37      3        0   1451
8   2013        1           22        895        309           76          27      5        3   1337
9   2013        2           53       1081        353          105          33      5        0   1630
10  2013        3           41       1051        340           88          47      6        0   1573
11  2013        4           53       1009        335           99          32      6        0   1534
12  2014        1           58       1150        307           75          42      8        0   1640
13  2014        2           60       1157        349           88          26      6        0   1686
14  2014        3           51       1203        363           88          46      7       10   1768
15  2014        4           66       1120        336           94          32      5        0   1653
16  2015        1           64       1064        355           86          39      8        0   1616
17  2015        2           57       1072        364           86          42      7        0   1628
18  2015        3           71        893        355          102          44     10        0   1475
19  2015        4           59        904        356          106          40     10        0   1475
20  2016        1           66        950        399          105          42      3        0   1565
21  2016        2           68        908        360          108          39      9        0   1492
22  2016        3           73        904        328          110          40     11        0   1466
23  2016        4           85        796        277          101          36      7        0   1302
24  2017        1           91        847        348           87          38     12        0   1423
25  2017        2           77        812        318          110          59     11        0   1387
26  2017        3           91        771        292           97          42     14        0   1307
27  2017        4           86        736        299          122          59     19        0   1321
28  2018        1           74        759        288          111          44     15        1   1292
29  2018        2           50        772        254          118          75      6        0   1275
30  2018        3           75        695        251           99          42      9        0   1171
31  2018        4           65        701        245           97          68     12        0   1188
32  2019        1           66        870        222          115          51      8        0   1332
33  2019        2           63        764        216          103          44     14        0   1204
34  2019        3           57        800        223          110          65     14        1   1270
35  2019        4           64        755        206          124          40     17        0   1206
36  2020        1           56        717        183           87          45     12        0   1100
37  2020        2           31        373         83           60          35      9        0    591
38  2020        3           33        662        209           72          37     17        0   1030
39  2020        4           31        742        192           71          57     15        3   1111
40  2021        1           31        797        208           74          50     17        0   1177
41  2021        2           46        733        225           93          51     12        1   1161
42  2021        3           30        715        197           93          46     29        0   1110
43  2021        4           30        641        173           76          45     18        0    983
44  2022        1           17        574        154           92          43     14        0    894
45  2022        2           19        443        116           55          35     14        0    682

In [85]:
summary8 = f"""
SELECT year, 
        quarter,
        SUM(CASE WHEN placement ='Other Order' THEN 1 ELSE 0 END) other_order,
        SUM(CASE WHEN placement ='Placement' THEN 1 ELSE 0 END) placement,
        COUNT(*) total
FROM  fcsq.adopt_disposals5_non_adoption
WHERE year>2010
GROUP BY year, quarter
ORDER BY year, quarter;
"""
pydb.read_sql_query(summary8)

    year  quarter  other_order  placement  total
0   2011        1           36       1204   1240
1   2011        2           49       1182   1231
2   2011        3           66       1307   1373
3   2011        4           81       1424   1505
4   2012        1           76       1472   1548
5   2012        2           75       1514   1589
6   2012        3          117       1738   1855
7   2012        4           98       1753   1851
8   2013        1          139       1520   1659
9   2013        2          190       1651   1841
10  2013        3          221       1724   1945
11  2013        4          211       1360   1571
12  2014        1          215       1128   1343
13  2014        2          221       1019   1240
14  2014        3          269       1079   1348
15  2014        4          233       1074   1307
16  2015        1          257       1082   1339
17  2015        2          284       1021   1305
18  2015        3          254       1115   1369
19  2015        4          251       1170   1421
20  2016        1          239       1150   1389
21  2016        2          240       1137   1377
22  2016        3          191       1147   1338
23  2016        4          166       1137   1303
24  2017        1          134       1313   1447
25  2017        2          104       1170   1274
26  2017        3          103       1148   1251
27  2017        4          101       1059   1160
28  2018        1          100       1090   1190
29  2018        2          101       1151   1252
30  2018        3           98       1044   1142
31  2018        4          153       1127   1280
32  2019        1          106        978   1084
33  2019        2          138       1040   1178
34  2019        3          157        914   1071
35  2019        4          151        936   1087
36  2020        1          137        808    945
37  2020        2          110        553    663
38  2020        3          141        898   1039
39  2020        4          173        910   1083
40  2021        1          151        967   1118
41  2021        2          125        858    983
42  2021        3          117        767    884
43  2021        4           87        816    903
44  2022        1           88        696    784
45  2022        2           54        405    459

In [86]:
summary9 = f"""
SELECT year,
        quarter, 
        COUNT(*) total_non_orders
FROM fcsq.adopt_disposals5_non_orders
WHERE year>2010
GROUP BY year, quarter
ORDER BY year, quarter;

"""
pydb.read_sql_query(summary9)

    year  quarter  total_non_orders
0   2011        1                44
1   2011        2                52
2   2011        3                50
3   2011        4                40
4   2012        1                70
5   2012        2                43
6   2012        3                61
7   2012        4                80
8   2013        1               100
9   2013        2               113
10  2013        3               123
11  2013        4               129
12  2014        1               192
13  2014        2               138
14  2014        3               178
15  2014        4               144
16  2015        1               149
17  2015        2               172
18  2015        3               202
19  2015        4               142
20  2016        1               139
21  2016        2               123
22  2016        3               134
23  2016        4               137
24  2017        1               174
25  2017        2               140
26  2017        3               115
27  2017        4               147
28  2018        1               122
29  2018        2               124
30  2018        3               121
31  2018        4               140
32  2019        1               112
33  2019        2               152
34  2019        3               127
35  2019        4               135
36  2020        1                95
37  2020        2                67
38  2020        3               139
39  2020        4               145
40  2021        1               167
41  2021        2                97
42  2021        3               104
43  2021        4               128
44  2022        1               172
45  2022        2                76

In [87]:
#Summary 10: of disposal case counts


create_adopt_disposal_cases = f"""
SELECT disposals5.case_number, 
        MIN(disposals5.receipt_date) AS minofreceipt_date 
FROM fcsq.adopt_disposals5 disposals5
GROUP BY disposals5.case_number;
"""

pydb.create_temp_table(create_adopt_disposal_cases, "adopt_disposal_cases")

create_adopt_disposal_cases_b = f"""
SELECT disposal_cases.minofreceipt_date,
        disposal_cases.case_number,
        cast(EXTRACT(YEAR FROM (disposal_cases.minofreceipt_date)) as varchar(3)) ||' - '||

        CASE WHEN EXTRACT(MONTH FROM (disposal_cases.minofreceipt_date))<4 THEN '1'
              WHEN EXTRACT(MONTH FROM (disposal_cases.minofreceipt_date))<7 THEN '2'
              WHEN EXTRACT(MONTH FROM (disposal_cases.minofreceipt_date))<10 THEN '3'
              ELSE '4'
              END AS quarter

FROM __temp__.adopt_disposal_cases disposal_cases;
"""
pydb.create_temp_table(create_adopt_disposal_cases_b, "adopt_disposal_cases_b")

create_adopt_disp_case_count_total ="""
SELECT quarter, 
        COUNT(case_number) as count_of_case
FROM __temp__.adopt_disposal_cases_b
GROUP BY  quarter;

"""
pydb.read_sql_query(create_adopt_disp_case_count_total)

     quarter  count_of_case
0   2000 - 4           1123
1   2020 - 2           1305
2   2005 - 4           1588
3   2016 - 2           2960
4   2014 - 3           3245
..       ...            ...
89  2020 - 4           2302
90  1998 - 4              1
91  2003 - 4           1726
92  2019 - 1           2499
93  2021 - 4           1998

[94 rows x 2 columns]

## 27. adopt_disposals5_2011 table - Splits the adopt_disposals5 table extracting just cases from 2011 onwards
<a name="adopt_disposals5_2011"></a>

### Drop the adopt_disposals5_2011 table if it already exists and remove its data from the S3 bucket

In [88]:
drop_adopt_disposals5_2011 = f"""
DROP TABLE IF EXISTS fcsq.adopt_disposals5_2011;
"""
pydb.start_query_execution_and_wait(drop_adopt_disposals5_2011)

# clean up previous adopt_disposals5_2011 files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_disposals5_2011/").delete();

### Create the adopt_disposals5_2011 table in Athena

In [89]:
create_adopt_disposals5_2011 = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_disposals5_2011
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_disposals5_2011') AS
SELECT t1.*
FROM fcsq.adopt_Disposals5 t1
WHERE year >2010;
"""

pydb.start_query_execution_and_wait(create_adopt_disposals5_2011);

#### adopt_disposals5_2011 validation

In [90]:
adopt_disposals5_2011_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_disposals5_2011")
adopt_disposals5_2011_count

    count
0  124135

In [91]:
"""
/* The next couple of queries are here to find the court level data for the 
court level/DFJ file. We do not use the below for FCSQ anymore - table names will be wrong*/

/*Query 18
Firstly the disposals court level file*/

/*

select year, 
        quarter, 
        court, 
        count(*) court_Total
from Adoptions_Disposals5_adoption
where year>2010
group by year, quarter, court
order by year, quarter, court;
     
/*Secondly the applications case level court level file*/

/*
drop table adopt_Disposal_case_count_A; 
Create table adopt_Disposal_case_count_A AS

SELECT t1.CASE_NUMBER, 
        Min(t1.Receipt_date) AS MinOfReceipt_date,
        t1.Court 
FROM adopt_Disposals5 t1 
GROUP BY t1.CASE_NUMBER, t1.Court;

drop table adopt_Disposal_case_count_B;
Create table adopt_Disposal_case_count_B AS

SELECT CASE_NUMBER, 
        extract (Year from (MinOfReceipt_date)) AS YEAR,

        CASE WHEN extract(Month from(MinOfReceipt_date))<4 THEN 1
              WHEN extract(Month from(MinOfReceipt_date))<7 THEN 2
              WHEN extract(Month from(MinOfReceipt_date))<10 THEN 3
              ELSE 4
              END AS Quarter,
        
        MinOfReceipt_date,
        Court 
        
FROM adopt_Disposal_case_count_A;
""";

# Stage 4 - Update the country of birth lookup
<a name="Country_of_birth_lookup_update"></a>

In [19]:
#Create parquet file to add into athena for birth_country_lookup table
data = pd.read_csv('s3://alpha-family-data/fcsq_processing/Adoption/birth_country_lookup_csv/Adopt_birth_country_lookup.csv')
import os
os.environ['AWS_DEFAULT_REGION'] = 'eu-west-2'
import awswrangler as wr
wr.s3.to_parquet(  # Storing the data and metadata to Data Lake
    df=data,
    path="s3://alpha-family-data/fcsq_processing/Adoption/birth_country_lookup_csv/birth_country_lookup_parquet/",
    dataset=True, database = "default", table = "birth_country_lookup"
)

{'paths': ['s3://alpha-family-data/fcsq_processing/Adoption/birth_country_lookup_csv/birth_country_lookup_parquet/f17086122d934e738c669bc54a377ee4.snappy.parquet'],
 'partitions_values': {}}

In [23]:
#Create parquet file to add into athena for event_model_desc table
data = pd.read_csv('s3://alpha-family-data/fcsq_processing/Adoption/event_model_desc_csv/Event_model_desc.csv')
import os
os.environ['AWS_DEFAULT_REGION'] = 'eu-west-2'
import awswrangler as wr
wr.s3.to_parquet(  # Storing the data and metadata to Data Lake
    df=data,
    path="s3://alpha-family-data/fcsq_processing/Adoption/event_model_desc_csv/Event_model_desc_parquet/",
    dataset=True, database = "default", table = "adoption_event_model_desc",
    mode="overwrite")

{'paths': ['s3://alpha-family-data/fcsq_processing/Adoption/event_model_desc_csv/Event_model_desc_parquet/10ea1691011b4cffa78033f12fb3f74b.snappy.parquet'],
 'partitions_values': {}}

## 28. adopt_birth_country_unknown table - Creates a table containing the nationalities we do not currently have registered
<a name="adopt_birth_country_unknown"></a>

### Create the adopt_birth_country_unknown temp table

In [4]:
create_adopt_birth_country_unknown = f"""
SELECT DISTINCT
        a.country_of_birth,
        b.nationality
FROM fcsq.adopt_disposals5_2011 a

LEFT JOIN fcsq.adopt_birth_country_lookup b
  ON a.country_of_birth = b.country_of_birth
  
WHERE a.country_of_birth IS NOT NULL
  AND b.nationality IS NULL;
"""

pydb.create_temp_table(create_adopt_birth_country_unknown,"adopt_birth_country_unknown")

#### adopt_birth_country_unknown validation

In [95]:
adopt_birth_country_unknown_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_birth_country_unknown")
adopt_birth_country_unknown_count

   count
0     23

In [96]:
pydb.read_sql_query("select country_of_birth from __temp__.adopt_birth_country_unknown")

                                                        country_of_birth
0                                                     republic of uganda
1                                                            east sussex
2                                                                 madrid
3                                                                unknown
4                                                davao city, philippines
5                                                              bucharest
6                                                      state of colorado
7                                    evangelisches krankenhaus bielefeld
8                                                    republic of albania
9                                                         nagaram, india
10                          makera-kaduna, kaduna south, kaduna, nigeria
11                                                                norway
12                                                       the phillipines
13                                                   republic of lativia
14                                                                malaga
15                                                              thialand
16                                                                   n/a
17                                                the republic of uganda
18                                                             thaiiland
19  wichian buri sub-district municipality, phetchabun province thailand
20                                                          eire ireland
21                                                   swiss confederation
22                                                                serbia

## 29. adopt_birth_country_added table - This is where we have to manually add the unknown nationalities and flag as either foreign or in the UK
<a name="adopt_birth_country_added"></a>

### Create the adopt_birth_country_added temp table

In [97]:
"""
Manually go through each of the unknown country_of_birth values from the previous query and add them into the code below
either under foreign or uk countries
"""
create_adopt_birth_country_added = f"""
SELECT country_of_birth,
        CASE WHEN country_of_birth IN ('lithunia', 'republic of the philipines', 'united states of america (the city of new york)', 'morroco', 'saint lucia') /*update countries listed according to list in 'adopt_birth_country_unknown'*/
                THEN 2 /* For foreign countries only */
              /*WHEN country_of_birth in ('...')
                THEN 1*/ /*UK countries only - add to when necessary*/
              END AS nationality

FROM __temp__.adopt_birth_country_unknown;
"""

pydb.create_temp_table(create_adopt_birth_country_added,'adopt_birth_country_added')

#### adopt_birth_country_added validation

In [98]:
adopt_birth_country_added_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_birth_country_added")
adopt_birth_country_added_count

   count
0     23

## 30. adopt_country_lookup_update table - Joins the existing lookup table with the new added data
<a name="adopt_country_lookup_update"></a>

### Create the adopt_country_lookup_update temp table

In [99]:
create_adopt_country_lookup_update = f"""
SELECT country_of_birth, nationality      /* To account for the columns being in a different order from the '_added' table */
FROM fcsq.adopt_birth_country_lookup

UNION
SELECT *
FROM __temp__.adopt_birth_country_added

ORDER BY country_of_birth;

"""

pydb.create_temp_table(create_adopt_country_lookup_update,'adopt_country_lookup_update')

#### adopt_country_lookup_update validation

In [100]:
adopt_country_lookup_update_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_country_lookup_update")
adopt_country_lookup_update_count

   count
0    618

## 31. adopt_birth_country_lookup table - updates the lookup table using the newly updated temporary table
<a name="adopt_birth_country_lookup"></a>

### Drop the adopt_birth_country_lookup table if it already exists and remove its data from the S3 bucket

In [101]:
drop_adopt_birth_country_lookup = f"""
DROP TABLE IF EXISTS fcsq.adopt_birth_country_lookup;
"""
pydb.start_query_execution_and_wait(drop_adopt_birth_country_lookup)

# clean up previous adopt_birth_country_lookup files
bucket.objects.filter(Prefix="fcsq_processing/Adoption/adopt_birth_country_lookup/").delete();

### Update the adopt_birth_country_lookup table in Athena

In [102]:
create_adopt_birth_country_lookup = f"""
CREATE TABLE IF NOT EXISTS fcsq.adopt_birth_country_lookup
WITH (format = 'PARQUET', external_location = 's3://alpha-family-data/fcsq_processing/Adoption/adopt_birth_country_lookup') AS
SELECT *
FROM __temp__.adopt_country_lookup_update;
"""

pydb.start_query_execution_and_wait(create_adopt_birth_country_lookup);

#### adopt_birth_country_lookup validation

In [103]:
adopt_birth_country_lookup_count = pydb.read_sql_query("select count(*) as count from fcsq.adopt_birth_country_lookup")
adopt_birth_country_lookup_count

   count
0    618

# Stage 5 - Now to prepare the final output
<a name="Stage_5_-_Preparing_the_final_output"></a>

## 32. adopt_adoptions_only_standard table - Creates a table with Adoption cases with a standard order type
<a name="adopt_adoptions_only_standard"></a>

### Create the adopt_adoptions_only_standard temp table

In [104]:
create_adopt_adoptions_only_standard = f"""
SELECT type,
        year,
        quarter,
        application,
        order_type,
        adopter_3,
        COUNT(*) AS count
FROM(

SELECT
  'Application' as type,
  year,
  quarter,
  adoption_cases AS application, /*see where clause below*/
  'Standard' AS order_type,
  CASE WHEN adopter_2 IN ('','Other')
         THEN 'Other or not stated'
       WHEN adopter_2 = 'mixed-sex couple'    
         THEN 'M/F couple'
       WHEN adopter_2 = 'same-sex couple'
         THEN 'Same sex couple'
     ELSE adopter_2
    END AS adopter_3
FROM
  fcsq.adopt_apps_6_adoptions_only
WHERE
  standard = 1 /*and adoption_cases = 'Adoption'*//*Adopt+other and foreign use adoption, standard and convention use adoption cases (copied from excel process*/
)

GROUP BY
  type,
  year,
  quarter,
  application,
  order_type,
  adopter_3;
"""

pydb.create_temp_table(create_adopt_adoptions_only_standard,"adopt_adoptions_only_standard")

#### adopt_adoptions_only_standard validation

In [105]:
adopt_adoptions_only_standard_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_adoptions_only_standard")
adopt_adoptions_only_standard_count

   count
0    366

## 33. adopt_adoption_only_convention table - Creates a table with Adoption cases with a convention order type
<a name="adopt_adoption_only_convention"></a>

### Create the adopt_adoption_only_convention temp table

In [106]:
create_adopt_adoptions_only_convention = f"""
SELECT type,
        year,
        quarter,
        application,
        order_type,
        adopter_3,
        COUNT(*) AS count
FROM(
  
SELECT
  'Application' as type,
  year,
  quarter,
  adoption_cases AS application, /*see where clause below*/
  'Convention' AS order_type,
  CASE WHEN adopter_2 IN ('','Other')
         THEN 'Other or not stated'
       WHEN adopter_2 = 'mixed-sex couple'
         THEN 'M/F couple'
       WHEN adopter_2 = 'same-sex couple'
         THEN 'Same sex couple'
     ELSE adopter_2
    END AS adopter_3
FROM
  fcsq.adopt_apps_6_adoptions_only
WHERE
  convention = 1 /*and adoption_cases = 'Adoption'*//*Adopt+other and foreign use adoption, standard and convention use adoption cases (copied from excel process*/
)

GROUP BY
  type,
  year,
  quarter,
  application,
  order_type,
  adopter_3;
"""

pydb.create_temp_table(create_adopt_adoptions_only_convention,'adopt_adoptions_only_convention')

#### adopt_adoption_only_convention validation

In [107]:
pydb.read_sql_query("select count(*) as count from __temp__.adopt_adoptions_only_convention")

   count
0     97

## 34. adopt_adoptions_only_foreign table - Creates a table with Adoption cases with a foreign order type
<a name="adopt_adoption_only_foreign"></a>

### Create the adopt_adoptions_only_foreign temp table

In [108]:
create_adopt_adoptions_only_foreign = f"""
SELECT type,
        year,
        quarter,
        application,
        order_type,
        adopter_3,
        COUNT(*) AS count
FROM(  
  
SELECT
  'Application' as type,
  year,
  quarter,
  adoption AS application, /*see where clause below*/
  'Foreign' AS order_type,
  CASE WHEN adopter_2 IN ('','Other')
         THEN 'Other or not stated'
       WHEN adopter_2 = 'mixed-sex couple'    
         THEN 'M/F couple'
       WHEN adopter_2 = 'same-sex couple'
         THEN 'Same sex couple'
     ELSE adopter_2
    END AS adopter_3
FROM
  fcsq.adopt_apps_6_adoptions_only
WHERE
  foreign = 1 and adoption = 'Adoption'/*Adopt+other and foreign use adoption, standard and convention use adoption cases (copied from excel process*/
)  
  
GROUP BY
  type,
  year,
  quarter,
  application,
  order_type,
  adopter_3;
"""

pydb.create_temp_table(create_adopt_adoptions_only_foreign,'adopt_adoptions_only_foreign')

#### adopt_adoptions_only_foreign validation

In [109]:
adopt_adoptions_only_foreign_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_adoptions_only_foreign")
adopt_adoptions_only_foreign_count

   count
0    147

## 35. adopt_adoptions_other_only table - Creates a table with Adoption cases with an other order type
<a name="adopt_adoptions_other_only"></a>

### Create the adopt_adoptions_other_only temp table

In [110]:
create_adopt_adoptions_other_only = f"""
SELECT type,
        year,
        quarter,
        application,
        order_type,
        adopter_3,
        COUNT(*) AS COUNT
FROM(  
  
SELECT
  'Application' as type,
  year,
  quarter,
  adoption AS application, /*see where clause below*/
  'Foreign' AS order_type,
  CASE WHEN adopter_2 IN ('','Other')
         THEN 'Other or not stated'
       WHEN adopter_2 = 'mixed-sex couple'    
         THEN 'M/F couple'
       WHEN adopter_2 = 'same-sex couple'
         THEN 'Same sex couple'
     ELSE adopter_2
    END AS adopter_3
FROM
  fcsq.adopt_apps_6_adoptions_only
WHERE
  foreign = 1 AND adoption = 'Adoption+other'/*Adopt+other and foreign use adoption, standard and convention use adoption cases (copied from excel process*/
)

GROUP BY
        type,
        year,
        quarter,
        application,
        order_type,
        adopter_3;
"""

pydb.create_temp_table(create_adopt_adoptions_other_only,'adopt_adoptions_other_only')

#### adopt_adoptions_other_only validation

In [111]:
adopt_adoptions_other_only_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_adoptions_other_only")
adopt_adoptions_other_only_count

   count
0     19

## 36. adopt_adoption_only table - Joins the standard, convention, foreign and other tables
<a name="adopt_adoption_only"></a>

### Create the adopt_adoption_only temp table

In [112]:
create_adopt_adoption_only = f"""
SELECT
  *
FROM
  __temp__.adopt_adoptions_only_standard
UNION ALL 
SELECT
  *
FROM
  __temp__.adopt_adoptions_only_convention
UNION ALL 
SELECT
  *
FROM
  __temp__.adopt_adoptions_only_foreign
UNION ALL 
SELECT
  *
FROM
  __temp__.adopt_adoptions_other_only;
"""

pydb.create_temp_table(create_adopt_adoption_only,'adopt_adoption_only')

#### adopt_adoption_only validation

In [113]:
adopt_adoption_only_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_adoption_only")
adopt_adoption_only_count

   count
0    629

## 37. adopt_adoption_placement table - Creates a table containing data on placement orders
<a name="adopt_adoption_placement"></a>

### Create the adopt_adoption_placement temp table

In [114]:
create_adopt_adoption_placement = f"""
SELECT
  'Application' AS type,
  year,
  quarter,
  'Non-adoption' as application,
  'Placement' AS order_type,
  'n/a' AS adopter,
   placement AS count
FROM
 fcsq.adopt_apps_6_non_adoptions
WHERE
  placement > 0;

"""

pydb.create_temp_table(create_adopt_adoption_placement,'adopt_adoption_placement')

In [115]:
pydb.read_sql_query("SELECT * FROM __TEMP__.adopt_adoption_placement")

              type  year  quarter   application order_type adopter  count
0      Application  2011        4  Non-adoption  Placement     n/a      1
1      Application  2011        4  Non-adoption  Placement     n/a      1
2      Application  2011        4  Non-adoption  Placement     n/a      1
3      Application  2011        4  Non-adoption  Placement     n/a      1
4      Application  2011        4  Non-adoption  Placement     n/a      1
...            ...   ...      ...           ...        ...     ...    ...
79458  Application  2018        3  Non-adoption  Placement     n/a      1
79459  Application  2018        3  Non-adoption  Placement     n/a      1
79460  Application  2018        3  Non-adoption  Placement     n/a      1
79461  Application  2018        3  Non-adoption  Placement     n/a      1
79462  Application  2018        3  Non-adoption  Placement     n/a      1

[79463 rows x 7 columns]

#### adopt_adoption_placement validation

In [116]:
adopt_adoption_placement_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_adoption_placement")
adopt_adoption_placement_count

   count
0  79463

## 38. adopt_placement_revoke_or_vary table - Creates a table containing data for a revoke and vary placement order
<a name="adopt_placement_revoke_or_vary"></a>

### Create the adopt_placement_revoke_or_vary temp table

In [117]:
create_adopt_placement_revoke_or_vary = f"""
SELECT
  'Application' AS type,
  year,
  quarter,
  'Non-adoption' as application,
  'Placement_revoke_or_vary' AS order_type,
  'n/a' AS adopter,
  placement_revoke_or_vary AS count
FROM
  fcsq.adopt_apps_6_non_adoptions
WHERE
  placement_revoke_or_vary > 0;
"""

pydb.create_temp_table(create_adopt_placement_revoke_or_vary,'adopt_placement_revoke_or_vary')

#### adopt_placement_revoke_or_vary validation

In [118]:
adopt_placement_revoke_or_vary_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_placement_revoke_or_vary")
adopt_placement_revoke_or_vary_count

   count
0   9041

## 39. adopt_adoption_contact_s26 table - Creates a table containing data where the order type is a contact order under the section 26 adoption and children act
<a name="adopt_adoption_contact_s26"></a>

### Create the adopt_adoption_contact_s26 temp table

In [119]:
create_adopt_adoption_contact_s26 = f"""
SELECT
  'Application' AS type,
  year,
  quarter,
  'Non-adoption' as application,
  'Contact_s26' AS order_type,
  'n/a' AS adopter,
  contact_s26 AS count
FROM
  fcsq.adopt_apps_6_non_adoptions
WHERE
  contact_s26 > 0;
"""

pydb.create_temp_table(create_adopt_adoption_contact_s26,'adopt_adoption_contact_s26')

#### adopt_adoption_contact_s26 validation

In [120]:
adopt_adoption_contact_s26_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_adoption_contact_s26")
adopt_adoption_contact_s26_count

   count
0    355

## 40. adopt_contact_s26_revoke_vary table - Creates a table containing data where the order type is a revoke or vary contact order under the section 26 adoption and children act
<a name="adopt_contact_s26_revoke_vary"></a>

### Create the adopt_contact_s26_revoke_vary temp table

In [121]:
create_adopt_contact_s26_revoke_vary = f"""
SELECT
  'Application' AS type,
  year,
  quarter,
  'Non-adoption' as application,
  'Contact_s26_revoke_or_vary' AS order_type,
  'n/a' AS adopter,
  contact_s26_revoke_or_vary AS count
FROM
  fcsq.adopt_apps_6_non_adoptions
WHERE
  contact_s26_revoke_or_vary > 0;
"""

pydb.create_temp_table(create_adopt_contact_s26_revoke_vary,'adopt_contact_s26_revoke_vary')

#### adopt_contact_s26_revoke_vary validation

In [122]:
adopt_contact_s26_revoke_vary_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_contact_s26_revoke_vary")
adopt_contact_s26_revoke_vary_count

   count
0     46

## 41. adopt_change_surname table - Creates a table of cases where the order type is changing surnames
<a name="adopt_change_surname"></a>

### Create the adopt_change_surname temp table

In [123]:
create_adopt_change_surname = f"""
SELECT
  'Application' AS type,
  year,
  quarter,
  'Non-adoption' as application,
  'Change_surname' AS order_type,
  'n/a' AS adopter,
  change_surname AS count
FROM
  fcsq.adopt_apps_6_non_adoptions
WHERE
  change_surname > 0;
"""

pydb.create_temp_table(create_adopt_change_surname,'adopt_change_surname')

#### adopt_change_surname validation

In [124]:
adopt_change_surname_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_change_surname")
adopt_change_surname_count

   count
0    511

## 42. adopt_remove_child_from_uk table - Creates a table of cases where the order type is removing a child from the UK
<a name="adopt_remove_child_from_uk"></a>

### Create the adopt_remove_child_from_uk temp table

In [125]:
create_adopt_remove_child_from_uk = f"""
SELECT
  'Application' AS type,
  year,
  quarter,
  'Non-adoption' as application,
  'Remove_child_from_UK' AS order_type,
  'n/a' AS adopter,
  remove_child_from_uk AS count
FROM
  fcsq.adopt_apps_6_non_adoptions
WHERE
  remove_child_from_uk > 0;
"""

pydb.create_temp_table(create_adopt_remove_child_from_uk,'adopt_remove_child_from_uk')

#### adopt_remove_child_from_uk validation

In [126]:
adopt_remove_child_from_uk_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_remove_child_from_uk")
adopt_remove_child_from_uk_count

   count
0     83

## 43. adopt_other_order_type table - Creates a table of cases where the order type is other
<a name="adopt_other_order_type"></a>

### Create the adopt_other_order_type temp table

In [127]:
create_adopt_other_order_type = f"""
SELECT
  'Application' AS type,
  year,
  quarter,
  'Non-adoption' as application,
  'Other_order_type' AS order_type,
  'n/a' AS adopter,
  other_order_type AS count
FROM
  fcsq.adopt_apps_6_non_adoptions
WHERE
  other_order_type > 0;
"""

pydb.create_temp_table(create_adopt_other_order_type,'adopt_other_order_type')

#### adopt_other_order_type validation

In [128]:
adopt_other_order_type_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_other_order_type")
adopt_other_order_type_count

   count
0    623

## 44. adopt_non_adopt_types table - Joins all the non-adoption type tables together
<a name="adopt_non_adopt_types"></a>

### Create the adopt_non_adopt_types temp table

In [129]:
create_adopt_non_adopt_types = f"""
SELECT
  *
FROM
  __temp__.adopt_adoption_placement
UNION ALL
SELECT
  *
FROM
  __temp__.adopt_placement_revoke_or_vary
UNION ALL
SELECT
  *
FROM
  __temp__.adopt_adoption_contact_s26
UNION ALL
SELECT
  *
FROM
  __temp__.adopt_contact_s26_revoke_vary
UNION ALL
SELECT
  *
FROM
  __temp__.adopt_change_surname
UNION ALL
SELECT
  *
FROM
  __temp__.adopt_remove_child_from_uk
UNION ALL
SELECT
  *
FROM
  __temp__.adopt_other_order_type;
"""

pydb.create_temp_table(create_adopt_non_adopt_types,'adopt_non_adopt_types')

#### adopt_non_adopt_types validation

In [130]:
adopt_non_adopt_types_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_non_adopt_types")
adopt_non_adopt_types_count

   count
0  90122

## 45. adopt_non_adoptions table - Group the non-adoption cases together and produces a count for each type and quarter
<a name="adopt_non_adoptions"></a>

### Create the adopt_non_adoptions temp table

In [131]:
create_adopt_non_adoptions = f"""
SELECT
  type,
  year,
  quarter,
  application,
  order_type,
  adopter,
  SUM (count) AS count
FROM
  __temp__.adopt_non_adopt_types
GROUP BY
  type,
  year,
  quarter,
  application,
  order_type,
  adopter;
"""

pydb.create_temp_table(create_adopt_non_adoptions,'adopt_non_adoptions')

#### adopt_non_adoptions validation

In [132]:
adopt_non_adoptions_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_non_adoptions")
adopt_non_adoptions_count

   count
0    382

## 46. adopt_applications table - Joins the adoption_only table with the non_adoptions table
<a name="adopt_applications"></a>

### Create the adopt_applications temp table

In [133]:
create_adopt_applications = f"""

SELECT
  type,
  year,
  quarter,
  application,
  order_type,
  adopter_3 AS adopter,
  'n/a' as adopted_child_sex,    
  'n/a' as adopted_child_age,
  count
FROM
  __temp__.adopt_adoption_only
UNION ALL
SELECT
  type,
  year,
  quarter,
  application,
  order_type,
  adopter,
  'n/a' as adopted_child_sex,    
  'n/a' as adopted_child_age,
  count
FROM
  __temp__.adopt_non_adoptions;

"""

pydb.create_temp_table(create_adopt_applications,'adopt_applications')

#### adopt_applications validation

In [134]:
adopt_applications_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_applications")
adopt_applications_count

   count
0   1011

# Disposals

## 47. adopt_disp_details table - Joins the adopt_disposals5_2011 table with foreign flag from adopt_birth_country_lookup and the event model description from the adoption_event_model_desc table
<a name="adopt_disp_details"></a>

### Create the adopt_disp_details temp table

In [7]:
create_adopt_disp_details = f"""
SELECT
  a.*,
  CASE WHEN b.nationality = 2
    THEN 'Foreign'
    ELSE 'N'
  END AS foreign,
  c.event_model_desc
FROM
  fcsq.adopt_disposals5_2011 a
   LEFT JOIN fcsq.adopt_birth_country_lookup b
   ON a.country_of_birth = b.country_of_birth
   LEFT JOIN fcsq.adoption_event_model_desc c
    ON a.event_model = c.event_model;
"""

pydb.create_temp_table(create_adopt_disp_details,'adopt_disp_details')

#### adopt_disp_details validation

In [ ]:
adopt_disp_details_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_disp_details")
adopt_disp_details_count

   count
0    247

## 48. adopt_disp_csv_data table - Formats raw adopt_disp_details table data ready for CSV output 
<a name="adopt_disp_csv_data"></a>

### Create the adopt_disp_csv_data temp table

In [137]:
create_adopt_disp_csv_data = f"""
SELECT
  CASE WHEN adoption IN ('Adoption', 'Non-adoption') THEN 'Order granted'
       WHEN adoption = 'No order made' THEN 'No order granted'
     ELSE 'Check'
    END AS type,
  year,
  quarter,
  adoption,
  CASE WHEN adoption = 'Adoption'
         AND event_model = 'A77'
      THEN 'Convention'
       WHEN adoption = 'Adoption'
         AND foreign = 'Foreign'
      THEN 'Foreign'
       WHEN adoption = 'Adoption'
      THEN 'Standard'
     ELSE type
    END AS type_of_adoption,
  event_model_desc,
  CASE WHEN adoption IN ('No order made','Non-adoption')
         THEN 'n/a'
       WHEN adopter_2 IN ('','Other')
         THEN 'Other or not stated'
       WHEN adopter_2 = 'mixed-sex couple'    
         THEN 'M/F couple'
       WHEN adopter_2 = 'same-sex couple'
         THEN 'Same sex couple'
     ELSE adopter_2
    END AS adopter,
  CASE WHEN adoption IN ('No order made','Non-adoption')
         THEN 'n/a'
       WHEN child_sex = 1 THEN 'Male'
       WHEN child_sex = 2 THEN 'Female'
       ELSE 'Unknown'
     END AS adopted_child_sex,
  CASE WHEN adoption IN ('No order made','Non-adoption')
         THEN 'n/a'
       WHEN age_band IN ('<1 year', '10-14 years', '1-4 years', '15-17 years', '5-9 years', 'Unknown')
        THEN age_band
      ELSE 'Other'
   END AS adopted_child_age
 FROM
   __temp__.adopt_disp_details;
"""

pydb.create_temp_table(create_adopt_disp_csv_data,'adopt_disp_csv_data')

#### adopt_disp_csv_data validation

In [138]:
adopt_disp_csv_data_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_disp_csv_data")
adopt_disp_csv_data_count

     count
0  1241350

## 49. adopt_disp_order_type table - adds order type to the adopt_disp_csv_data table
<a name="adopt_disp_order_type"></a>

### Create the adopt_disp_order_type temp table

In [139]:
create_adopt_disp_order_type = f"""
SELECT
  a.*,
  CASE WHEN a.adoption IN ('Adoption', 'Non-adoption')
      THEN type_of_adoption
       WHEN a.adoption = 'No order made'
      THEN event_model_desc
     END AS order_type
FROM
  __temp__.adopt_disp_csv_data a;
"""

pydb.create_temp_table(create_adopt_disp_order_type,'adopt_disp_order_type')

#### adopt_disp_order_type validation

In [140]:
adopt_disp_order_type_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_disp_order_type")
adopt_disp_order_type_count

     count
0  1241350

## 50. adopt_disposals table - groups all variables in adopt_disp_order_type table and produces a total count for each distinct row 
<a name="adopt_disposals"></a>

### Create the adopt_disposals temp table

In [141]:
create_adopt_disposals = f"""
SELECT
  type,
  year,
  quarter,
  adoption,
  order_type,
  adopter,
  adopted_child_sex,
  adopted_child_age,
  COUNT (*) AS count
FROM
  __temp__.adopt_disp_order_type
GROUP BY
  type,
  year,
  quarter,
  adoption,
  order_type,
  adopter,
  adopted_child_sex,
  adopted_child_age;
"""

pydb.create_temp_table(create_adopt_disposals,'adopt_disposals')

#### adopt_disposals validation

In [142]:
adopt_disposals_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_disposals")
adopt_disposals_count

   count
0   3193

# Cases

## 51. adopt_application_case_count table - Creates a table which produces totals for cases started per quarter from the adopt_application_4 table
<a name="adopt_application_case_count"></a>

### Create the adopt_application_case_count temp table

In [143]:
adopt_application_case_count_a = f"""
SELECT case_number,
        court, 
        MIN(app_date) AS minofapp_date
FROM fcsq.adopt_application_4 
WHERE year > 2010
GROUP BY case_number,court
ORDER BY 1,2;
"""
pydb.create_temp_table(adopt_application_case_count_a,"adopt_application_case_count_a")

In [144]:
create_adopt_application_case_count_table= f"""
SELECT type,
        year,
        quarter,
        adoption,
        order_type,
        adopter,
        adopted_child_sex,
        adopted_child_age,
        COUNT(*) AS count
FROM(        

SELECT 
  'Cases started' AS type,
  EXTRACT(YEAR FROM minofapp_date) year,

  CASE WHEN  Minofapp_date is null THEN null
        WHEN EXTRACT(MONTH FROM minofapp_date) BETWEEN 1 AND 3 THEN 1
        WHEN EXTRACT(MONTH FROM minofapp_date) BETWEEN 4 AND 6 THEN 2
        WHEN EXTRACT(MONTH FROM minofapp_date) BETWEEN 7 AND 9 THEN 3
        WHEN EXTRACT(MONTH FROM minofapp_date) BETWEEN 10 AND 12 THEN 4
        END quarter,
  
  'n/a' AS adoption,
  'n/a' AS order_type,
  'n/a' AS adopter,
  'n/a' AS adopted_child_sex,
  'n/a' AS adopted_child_age
FROM 
  __temp__.adopt_application_case_count_a
)  
  
GROUP BY
  type,
  year,
  quarter,
  adoption,
  order_type,
  adopter,
  adopted_child_sex,
  adopted_child_age;
"""

pydb.create_temp_table(create_adopt_application_case_count_table,"adopt_application_case_count_table")

#### adopt_application_case_count validation

In [145]:
adopt_application_case_count_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_application_case_count_table")
adopt_application_case_count_count

   count
0     46

## 52. adopt_disposal_case_count table - Creates a table which produces totals for cases closed per quarter from the adopt_disposal_cases table
<a name="adopt_disposal_case_count"></a>

### Create the adopt_disposal_case_count temp table

In [146]:
create_adopt_disposal_case_count = f"""
SELECT type,
        year,
        quarter,
        adoption,
        order_type,
        adopter,
        adopted_child_sex,
        adopted_child_age,
        COUNT(*) AS count
FROM( 

SELECT 
  'Cases closed' as type,
  EXTRACT(YEAR FROM minofreceipt_date) year,

  CASE WHEN  minofreceipt_date IS NULL THEN NULL
        WHEN EXTRACT(Month FROM minofreceipt_date) BETWEEN 1 AND 3 THEN 1
        WHEN EXTRACT(Month FROM minofreceipt_date) BETWEEN 4 AND 6 THEN 2
        WHEN EXTRACT(Month FROM minofreceipt_date) BETWEEN 7 AND 9 THEN 3
        WHEN EXTRACT(Month FROM minofreceipt_date) BETWEEN 10 AND 12 THEN 4
        END quarter,
  'n/a' AS adoption,
  'n/a' AS order_type,
  'n/a' AS adopter,
  'n/a' AS adopted_child_sex,
  'n/a' AS adopted_child_age
FROM 
  __temp__.adopt_disposal_cases
WHERE
  (EXTRACT(YEAR FROM minofreceipt_date)) > 2010
)  
  
GROUP BY
  type,
  year,
  quarter,
  adoption,
  order_type,
  adopter,
  adopted_child_sex,
  adopted_child_age;
"""

pydb.create_temp_table(create_adopt_disposal_case_count,'adopt_disposal_case_count')

#### adopt_disposal_case_count validation

In [147]:
adopt_disposal_case_count_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_disposal_case_count")
adopt_disposal_case_count_count

   count
0     46

## 53. adopt_csv table - Creates the initial version of the final CSV output, adding together the adopt_applications, adopt_disposals, adopt_application_case_count and adopt_disposal_case_count tables
<a name="adopt_csv"></a>

### Create the adopt_csv temp table

In [148]:
create_adopt_csv = f"""
SELECT
  *
FROM
  __temp__.adopt_applications
UNION ALL
SELECT
  *
FROM
  __temp__.adopt_disposals
UNION ALL
SELECT
  *
FROM
  __temp__.adopt_application_case_count_table
UNION ALL
SELECT
  *
FROM
  __temp__.adopt_disposal_case_count;
"""

pydb.create_temp_table(create_adopt_csv,'adopt_csv')

In [149]:
pydb.read_sql_query("SELECT distinct type from __temp__.adopt_csv")

               type
0      Cases closed
1     Order granted
2  No order granted
3       Application
4     Cases started

#### adopt_csv validation

In [150]:
pydb.read_sql_query("select count(*) as count from __temp__.adopt_csv")

   count
0   4296

## 54. adopt_csv2 table - Filters the adopt_csv2 table by later than 2010, not equal to the current quarter (update each quarter), and then orders the table. This is then converted and output to a CSV file
<a name="adopt_csv2"></a>

### Create the adopt_csv2 table csv

In [151]:
create_adopt_csv2 = f"""
SELECT
  *
FROM
  __temp__.adopt_csv
WHERE
  year > 2010
  AND NOT (year = {latest_year} AND quarter = {latest_quarter})
ORDER BY
  type,
  application,
  order_type,
  year,
  quarter,
  adopter,
  adopted_child_sex,
  adopted_child_age;
"""
temp_table = pydb.create_temp_table(create_adopt_csv2,'adopt_csv2')
table = pydb.read_sql_query(create_adopt_csv2)
table.to_csv(path_or_buf = 's3://alpha-family-data/CSVs/adopt_csv2.csv',index=False)
table

               type  year  quarter   application            order_type         adopter adopted_child_sex adopted_child_age  count
0       Application  2011        1      Adoption            Convention      M/F couple               n/a               n/a      5
1       Application  2011        1      Adoption            Convention  Sole applicant               n/a               n/a      3
2       Application  2011        2      Adoption            Convention      M/F couple               n/a               n/a      3
3       Application  2011        3      Adoption            Convention      M/F couple               n/a               n/a      1
4       Application  2011        4      Adoption            Convention      M/F couple               n/a               n/a      1
...             ...   ...      ...           ...                   ...             ...               ...               ...    ...
3890  Order granted  2016        4  Non-adoption  Remove_child_from_UK             n/a               n/a               n/a     20
3891  Order granted  2017        3  Non-adoption  Remove_child_from_UK             n/a               n/a               n/a     20
3892  Order granted  2017        4  Non-adoption  Remove_child_from_UK             n/a               n/a               n/a     10
3893  Order granted  2021        2  Non-adoption  Remove_child_from_UK             n/a               n/a               n/a     10
3894  Order granted  2022        2  Non-adoption  Remove_child_from_UK             n/a               n/a               n/a     10

[3895 rows x 9 columns]

In [152]:
adopt_csv2_count = pydb.read_sql_query("select count(*) as count from __temp__.adopt_csv2")
adopt_csv2_count

   count
0   3895